hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/mcu/common/hc32m120.h
typedef struct
{
    __IO uint32_t SWDTSTP                   : 1;
    uint32_t RESERVED1                      : 1;
    __IO uint32_t RTCSTP                    : 1;
    __IO uint32_t PVDSTP                    : 1;
    uint32_t RESERVED4                      :10;
    __IO uint32_t TMR01STP                  : 1;
    uint32_t RESERVED15                     : 2;
    __IO uint32_t TMR21STP                  : 1;
    uint32_t RESERVED18                     : 2;
    __IO uint32_t TMR41STP                  : 1;
    uint32_t RESERVED21                     : 2;
    __IO uint32_t TMRA1STP                  : 1;
    __IO uint32_t TMRB1STP                  : 1;
    __IO uint32_t TMRB2STP                  : 1;
    __IO uint32_t TMRB3STP                  : 1;
    __IO uint32_t TMRB4STP                  : 1;
    __IO uint32_t TMRB5STP                  : 1;
    __IO uint32_t TMRB6STP                  : 1;
    __IO uint32_t TMRB7STP                  : 1;
    __IO uint32_t TMRB8STP                  : 1;
} stc_dbgc_mcustpctl_field_t;

typedef struct
{
    __IO uint32_t AUTH                      : 1;
    __IO uint32_t REMVLOCK                  : 1;
    __IO uint32_t SAFTYLOCK1                : 1;
    __IO uint32_t SAFTYLOCK2                : 1;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t MCUSTAT0                  : 1;
    __IO uint32_t MCUSTAT1                  : 1;
    uint32_t RESERVED10                     :22;
} stc_dbgc_t_mcustat_field_t;

typedef struct
{
    __IO uint32_t EDBGRQ                    : 1;
    __IO uint32_t RESTART                   : 1;
    uint32_t RESERVED2                      : 6;
    __IO uint32_t DIRQ                      : 1;
    uint32_t RESERVED9                      :23;
} stc_dbgc_t_mcuctl_field_t;

typedef struct
{
    __IO uint32_t ERASEREQ                  : 1;
    __IO uint32_t ERASEACK                  : 1;
    __IO uint32_t ERASEERR                  : 1;
    uint32_t RESERVED3                      :29;
} stc_dbgc_t_fmcctl_field_t;

typedef struct
{
    __IO uint32_t EN                        : 1;
    uint32_t RESERVED1                      :31;
} stc_dma_en_field_t;

typedef struct
{
    __IO uint32_t TRNERR                    : 2;
    uint32_t RESERVED2                      :14;
    __IO uint32_t REQERR                    : 2;
    uint32_t RESERVED18                     :14;
} stc_dma_intstat0_field_t;

typedef struct
{
    __IO uint32_t TC                        : 2;
    uint32_t RESERVED2                      :14;
    __IO uint32_t BTC                       : 2;
    uint32_t RESERVED18                     :14;
} stc_dma_intstat1_field_t;

typedef struct
{
    __IO uint32_t MSKTRNERR                 : 2;
    uint32_t RESERVED2                      :14;
    __IO uint32_t MSKREQERR                 : 2;
    uint32_t RESERVED18                     :14;
} stc_dma_intmask0_field_t;

typedef struct
{
    __IO uint32_t MSKTC                     : 2;
    uint32_t RESERVED2                      :14;
    __IO uint32_t MSKBTC                    : 2;
    uint32_t RESERVED18                     :14;
} stc_dma_intmask1_field_t;

typedef struct
{
    __IO uint32_t CLRTRNERR                 : 2;
    uint32_t RESERVED2                      :14;
    __IO uint32_t CLRREQERR                 : 2;
    uint32_t RESERVED18                     :14;
} stc_dma_intclr0_field_t;

typedef struct
{
    __IO uint32_t CLRTC                     : 2;
    uint32_t RESERVED2                      :14;
    __IO uint32_t CLRBTC                    : 2;
    uint32_t RESERVED18                     :14;
} stc_dma_intclr1_field_t;

typedef struct
{
    __IO uint32_t CHEN                      : 2;
    uint32_t RESERVED2                      :30;
} stc_dma_chen_field_t;

typedef struct
{
    __IO uint32_t DMAACT                    : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t CHACT                     : 2;
    uint32_t RESERVED18                     :14;
} stc_dma_chstat_field_t;

typedef struct
{
    __IO uint32_t CHENCLR                   : 2;
    uint32_t RESERVED2                      :30;
} stc_dma_chenclr_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   : 8;
    __IO uint32_t CNT                       :10;
    __IO uint32_t LLP                       :10;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t HSIZE                     : 2;
} stc_dma_ch0ctl0_field_t;

typedef struct
{
    __IO uint32_t OFFSET                    :16;
    __IO uint32_t RPTNSCNT                  : 8;
    __IO uint32_t RPTNSEN                   : 1;
    __IO uint32_t RPTNSSEL                  : 2;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
} stc_dma_ch0ctl1_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   : 8;
    __IO uint32_t CNT                       :10;
    __IO uint32_t LLP                       :10;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t HSIZE                     : 2;
} stc_dma_ch1ctl0_field_t;

typedef struct
{
    __IO uint32_t OFFSET                    :16;
    __IO uint32_t RPTNSCNT                  : 8;
    __IO uint32_t RPTNSEN                   : 1;
    __IO uint32_t RPTNSSEL                  : 2;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
} stc_dma_ch1ctl1_field_t;

typedef struct
{
    __IO uint32_t FAPRT                     :16;
    uint32_t RESERVED16                     :16;
} stc_efm_faprt_field_t;

typedef struct
{
    __IO uint32_t FSTP                      : 1;
    uint32_t RESERVED1                      :31;
} stc_efm_fstp_field_t;

typedef struct
{
    __IO uint32_t FLWT                      : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t CACHE                     : 1;
    __IO uint32_t PREFETE                   : 1;
    __IO uint32_t CRST0                     : 1;
    uint32_t RESERVED19                     :13;
} stc_efm_frmc_field_t;

typedef struct
{
    __IO uint32_t PEMODE                    : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t PEMOD                     : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t BUSHLDCTL                 : 1;
    uint32_t RESERVED9                      :23;
} stc_efm_fwmc_field_t;

typedef struct
{
    __IO uint32_t PEWERR                    : 1;
    __IO uint32_t PEPRTERR                  : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PGMISMTCH                 : 1;
    __IO uint32_t OPTEND                    : 1;
    __IO uint32_t RDCOLERR                  : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t RDY                       : 1;
    uint32_t RESERVED9                      :23;
} stc_efm_fsr_field_t;

typedef struct
{
    __IO uint32_t PEWERRCLR                 : 1;
    __IO uint32_t PEPRTERRCLR               : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PGMISMTCHCLR              : 1;
    __IO uint32_t OPTENDCLR                 : 1;
    __IO uint32_t RDCOLERRCLR               : 1;
    uint32_t RESERVED6                      :26;
} stc_efm_fsclr_field_t;

typedef struct
{
    __IO uint32_t PEERRITE                  : 1;
    __IO uint32_t OPTENDITE                 : 1;
    __IO uint32_t RDCOLERRITE               : 1;
    uint32_t RESERVED3                      :29;
} stc_efm_fite_field_t;

typedef struct
{
    __IO uint32_t FPMTSW                    :15;
    uint32_t RESERVED15                     :17;
} stc_efm_fpmtsw_field_t;

typedef struct
{
    __IO uint32_t FPMTEW                    :15;
    uint32_t RESERVED15                     :17;
} stc_efm_fpmtew_field_t;

typedef struct
{
    __IO uint8_t HRCFREQS                   : 4;
    uint8_t RESERVED4                       : 4;
} stc_efm_hrccfgr_field_t;

typedef struct
{
    __IO uint16_t DFS                       : 2;
    __IO uint16_t DFDIS                     : 1;
    uint16_t RESERVED3                      : 5;
    __IO uint16_t LVDLVL                    : 4;
    __IO uint16_t NMIS                      : 1;
    __IO uint16_t IRS                       : 1;
    __IO uint16_t IRDIS                     : 1;
    __IO uint16_t LVDDIS                    : 1;
} stc_efm_lvdicgcr_field_t;

typedef struct
{
    __IO uint32_t PORTINEN                  : 1;
    __IO uint32_t CMPEN                     : 2;
    uint32_t RESERVED3                      : 2;
    __IO uint32_t OSCSTPEN                  : 1;
    __IO uint32_t PWMSEL                    : 3;
    uint32_t RESERVED9                      :19;
    __IO uint32_t NFSEL                     : 2;
    __IO uint32_t NFEN                      : 1;
    __IO uint32_t INVSEL                    : 1;
} stc_emb_ctl_field_t;

typedef struct
{
    __IO uint32_t PWMLV                     : 3;
    uint32_t RESERVED3                      :29;
} stc_emb_pwmlv_field_t;

typedef struct
{
    __IO uint32_t SOE                       : 1;
    uint32_t RESERVED1                      :31;
} stc_emb_soe_field_t;

typedef struct
{
    __IO uint32_t PORTINF                   : 1;
    __IO uint32_t PWMSF                     : 1;
    __IO uint32_t CMPF                      : 1;
    __IO uint32_t OSF                       : 1;
    __IO uint32_t PORTINST                  : 1;
    __IO uint32_t PWMST                     : 1;
    uint32_t RESERVED6                      :26;
} stc_emb_stat_field_t;

typedef struct
{
    __IO uint32_t PORTINFCLR                : 1;
    __IO uint32_t PWMSFCLR                  : 1;
    __IO uint32_t CMPFCLR                   : 1;
    __IO uint32_t OSFCLR                    : 1;
    uint32_t RESERVED4                      :28;
} stc_emb_statclr_field_t;

typedef struct
{
    __IO uint32_t PORTINTEN                 : 1;
    __IO uint32_t PWMINTEN                  : 1;
    __IO uint32_t CMPINTEN                  : 1;
    __IO uint32_t OSINTEN                   : 1;
    uint32_t RESERVED4                      :28;
} stc_emb_inten_field_t;

typedef struct
{
    __IO uint32_t PE                        : 1;
    __IO uint32_t SMBUS                     : 1;
    __IO uint32_t SMBALRTEN                 : 1;
    __IO uint32_t SMBDEFAULTEN              : 1;
    __IO uint32_t SMBHOSTEN                 : 1;
    __IO uint32_t FACKEN                    : 1;
    __IO uint32_t GCEN                      : 1;
    __IO uint32_t RESTART                   : 1;
    __IO uint32_t START                     : 1;
    __IO uint32_t STOP                      : 1;
    __IO uint32_t ACK                       : 1;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t SWRST                     : 1;
    uint32_t RESERVED16                     :16;
} stc_i2c_cr1_field_t;

typedef struct
{
    __IO uint32_t STARTIE                   : 1;
    __IO uint32_t SLADDR0IE                 : 1;
    __IO uint32_t SLADDR1IE                 : 1;
    __IO uint32_t TENDIE                    : 1;
    __IO uint32_t STOPIE                    : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t RFULLIE                   : 1;
    __IO uint32_t TEMPTYIE                  : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ARLOIE                    : 1;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t NACKIE                    : 1;
    uint32_t RESERVED13                     : 7;
    __IO uint32_t GENCALLIE                 : 1;
    __IO uint32_t SMBDEFAULTIE              : 1;
    __IO uint32_t SMBHOSTIE                 : 1;
    __IO uint32_t SMBALRTIE                 : 1;
    uint32_t RESERVED24                     : 8;
} stc_i2c_cr2_field_t;

typedef struct
{
    __IO uint32_t SLADDR0                   :10;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t SLADDR0EN                 : 1;
    uint32_t RESERVED13                     : 2;
    __IO uint32_t ADDRMOD0                  : 1;
    uint32_t RESERVED16                     :16;
} stc_i2c_slr0_field_t;

typedef struct
{
    __IO uint32_t SLADDR1                   :10;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t SLADDR1EN                 : 1;
    uint32_t RESERVED13                     : 2;
    __IO uint32_t ADDRMOD1                  : 1;
    uint32_t RESERVED16                     :16;
} stc_i2c_slr1_field_t;

typedef struct
{
    __IO uint32_t STARTF                    : 1;
    __IO uint32_t SLADDR0F                  : 1;
    __IO uint32_t SLADDR1F                  : 1;
    __IO uint32_t TENDF                     : 1;
    __IO uint32_t STOPF                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t RFULLF                    : 1;
    __IO uint32_t TEMPTYF                   : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ARLOF                     : 1;
    __IO uint32_t ACKRF                     : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t NACKF                     : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t MSL                       : 1;
    __IO uint32_t BUSY                      : 1;
    __IO uint32_t TRA                       : 1;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t GENCALLF                  : 1;
    __IO uint32_t SMBDEFAULTF               : 1;
    __IO uint32_t SMBHOSTF                  : 1;
    __IO uint32_t SMBALRTF                  : 1;
    uint32_t RESERVED24                     : 8;
} stc_i2c_sr_field_t;

typedef struct
{
    __IO uint32_t STARTFCLR                 : 1;
    __IO uint32_t SLADDR0FCLR               : 1;
    __IO uint32_t SLADDR1FCLR               : 1;
    __IO uint32_t TENDFCLR                  : 1;
    __IO uint32_t STOPFCLR                  : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t RFULLFCLR                 : 1;
    __IO uint32_t TEMPTYFCLR                : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ARLOFCLR                  : 1;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t NACKFCLR                  : 1;
    uint32_t RESERVED13                     : 7;
    __IO uint32_t GENCALLFCLR               : 1;
    __IO uint32_t SMBDEFAULTFCLR            : 1;
    __IO uint32_t SMBHOSTFCLR               : 1;
    __IO uint32_t SMBALRTFCLR               : 1;
    uint32_t RESERVED24                     : 8;
} stc_i2c_clr_field_t;

typedef struct
{
    __IO uint32_t DT                        : 8;
    uint32_t RESERVED8                      :24;
} stc_i2c_dtr_field_t;

typedef struct
{
    __IO uint32_t DR                        : 8;
    uint32_t RESERVED8                      :24;
} stc_i2c_drr_field_t;

typedef struct
{
    __IO uint32_t SLOWW                     : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t SHIGHW                    : 5;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t CKDIV                     : 3;
    uint32_t RESERVED19                     :13;
} stc_i2c_ccr_field_t;

typedef struct
{
    __IO uint32_t DNF                       : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t DNFEN                     : 1;
    __IO uint32_t ANFEN                     : 1;
    uint32_t RESERVED6                      :26;
} stc_i2c_fltr_field_t;

typedef struct
{
    __IO uint32_t SWDTAUTS                  : 1;
    __IO uint32_t SWDTITS                   : 1;
    __IO uint32_t SWDTPERI                  : 2;
    __IO uint32_t SWDTCKS                   : 4;
    __IO uint32_t SWDTWDPT                  : 4;
    __IO uint32_t SWDTSLPOFF                : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t HRCREQS                   : 4;
    uint32_t RESERVED20                     : 6;
    __IO uint32_t NMIFCLK                   : 2;
    __IO uint32_t NMIFEN                    : 1;
    __IO uint32_t NMITRG                    : 1;
    __IO uint32_t NMIEN                     : 1;
    __IO uint32_t NMIICGENA                 : 1;
} stc_icg_icg0_field_t;

typedef struct
{
    __IO uint32_t DFS                       : 2;
    __IO uint32_t DFDIS                     : 1;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t LVDLVL                    : 4;
    __IO uint32_t NMIS                      : 1;
    __IO uint32_t IRS                       : 1;
    __IO uint32_t IRDIS                     : 1;
    __IO uint32_t LVDDIS                    : 1;
    uint32_t RESERVED16                     :16;
} stc_icg_icg1_field_t;

typedef struct
{
    __IO uint32_t NMITRG                    : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t NMIFCLK                   : 2;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t NMIFEN                    : 1;
    uint32_t RESERVED8                      :24;
} stc_intc_nmicr_field_t;

typedef struct
{
    __IO uint32_t NMIEN                     : 1;
    __IO uint32_t XTALSTPEN                 : 1;
    __IO uint32_t SWDTEN                    : 1;
    __IO uint32_t PVDEN                     : 1;
    uint32_t RESERVED4                      :28;
} stc_intc_nmier_field_t;

typedef struct
{
    __IO uint32_t NMIF                      : 1;
    __IO uint32_t XTALSTPF                  : 1;
    __IO uint32_t SWDTF                     : 1;
    __IO uint32_t PVDF                      : 1;
    uint32_t RESERVED4                      :28;
} stc_intc_nmifr_field_t;

typedef struct
{
    __IO uint32_t NMICL                     : 1;
    __IO uint32_t XTALSTPCL                 : 1;
    __IO uint32_t SWDTCL                    : 1;
    __IO uint32_t PVDCL                     : 1;
    uint32_t RESERVED4                      :28;
} stc_intc_nmiclr_field_t;

typedef struct
{
    __IO uint32_t EVTEN0                    : 1;
    __IO uint32_t EVTEN1                    : 1;
    __IO uint32_t EVTEN2                    : 1;
    __IO uint32_t EVTEN3                    : 1;
    __IO uint32_t EVTEN4                    : 1;
    __IO uint32_t EVTEN5                    : 1;
    __IO uint32_t EVTEN6                    : 1;
    __IO uint32_t EVTEN7                    : 1;
    uint32_t RESERVED8                      :24;
} stc_intc_evter_field_t;

typedef struct
{
    __IO uint32_t EKEY0EN                   : 1;
    __IO uint32_t EKEY1EN                   : 1;
    __IO uint32_t EKEY2EN                   : 1;
    __IO uint32_t EKEY3EN                   : 1;
    __IO uint32_t EKEY4EN                   : 1;
    __IO uint32_t EKEY5EN                   : 1;
    uint32_t RESERVED6                      :26;
} stc_intc_ekeycr_field_t;

typedef struct
{
    __IO uint32_t FPRC                      : 8;
    uint32_t RESERVED8                      :24;
} stc_intc_fprcr_field_t;

typedef struct
{
    __IO uint32_t EIRQTRG                   : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t EIRQFCLK                  : 2;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t EIRQFEN                   : 1;
    uint32_t RESERVED8                      :24;
} stc_intc_eirqcr_field_t;

typedef struct
{
    __IO uint32_t EIRQWUEN                  :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t SWDTWUEN                  : 1;
    __IO uint32_t EKEYWUEN                  : 1;
    __IO uint32_t TMR0CMPWUEN               : 1;
    __IO uint32_t TMR2CMPWUEN               : 1;
    __IO uint32_t TMR2OVFWUEN               : 1;
    __IO uint32_t CMPWUEN                   : 1;
    __IO uint32_t PVDWUEN                   : 1;
    uint32_t RESERVED23                     : 9;
} stc_intc_wupenr_field_t;

typedef struct
{
    __IO uint32_t EIRQF                     :10;
    uint32_t RESERVED10                     :22;
} stc_intc_eirqfr_field_t;

typedef struct
{
    __IO uint32_t EIRQCL                    :10;
    uint32_t RESERVED10                     :22;
} stc_intc_eirqclr_field_t;

typedef struct
{
    __IO uint32_t ISEL                      : 4;
    uint32_t RESERVED4                      :28;
} stc_intc_iselar_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t ISEL                      :15;
    uint32_t RESERVED16                     :16;
} stc_intc_iselbr_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_pidr0_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    __IO uint8_t PIN2                       : 1;
    __IO uint8_t PIN3                       : 1;
    __IO uint8_t PIN4                       : 1;
    __IO uint8_t PIN5                       : 1;
    __IO uint8_t PIN6                       : 1;
    __IO uint8_t PIN7                       : 1;
} stc_port_pidr1_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    __IO uint8_t PIN2                       : 1;
    __IO uint8_t PIN3                       : 1;
    __IO uint8_t PIN4                       : 1;
    __IO uint8_t PIN5                       : 1;
    __IO uint8_t PIN6                       : 1;
    __IO uint8_t PIN7                       : 1;
} stc_port_pidr2_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_pidr3_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_pidr4_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_pidr5_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    __IO uint8_t PIN2                       : 1;
    __IO uint8_t PIN3                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_pidr6_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    __IO uint8_t PIN2                       : 1;
    __IO uint8_t PIN3                       : 1;
    __IO uint8_t PIN4                       : 1;
    __IO uint8_t PIN5                       : 1;
    uint8_t RESERVED6                       : 2;
} stc_port_pidr7_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    __IO uint8_t PIN2                       : 1;
    __IO uint8_t PIN3                       : 1;
    __IO uint8_t PIN4                       : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_pidr12_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    uint8_t RESERVED1                       : 6;
    __IO uint8_t PIN7                       : 1;
} stc_port_pidr13_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    uint8_t RESERVED1                       : 5;
    __IO uint8_t PIN6                       : 1;
    __IO uint8_t PIN7                       : 1;
} stc_port_pidr14_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_podr0_field_t;

