hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/mcu/common/hc32m120.h
typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    __IO uint8_t POUT2                      : 1;
    __IO uint8_t POUT3                      : 1;
    __IO uint8_t POUT4                      : 1;
    __IO uint8_t POUT5                      : 1;
    __IO uint8_t POUT6                      : 1;
    __IO uint8_t POUT7                      : 1;
} stc_port_podr1_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    __IO uint8_t POUT2                      : 1;
    __IO uint8_t POUT3                      : 1;
    __IO uint8_t POUT4                      : 1;
    __IO uint8_t POUT5                      : 1;
    __IO uint8_t POUT6                      : 1;
    __IO uint8_t POUT7                      : 1;
} stc_port_podr2_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_podr3_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_podr4_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_podr5_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    __IO uint8_t POUT2                      : 1;
    __IO uint8_t POUT3                      : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_podr6_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    __IO uint8_t POUT2                      : 1;
    __IO uint8_t POUT3                      : 1;
    __IO uint8_t POUT4                      : 1;
    __IO uint8_t POUT5                      : 1;
    uint8_t RESERVED6                       : 2;
} stc_port_podr7_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    __IO uint8_t POUT2                      : 1;
    __IO uint8_t POUT3                      : 1;
    __IO uint8_t POUT4                      : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_podr12_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    uint8_t RESERVED1                       : 6;
    __IO uint8_t POUT7                      : 1;
} stc_port_podr13_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    uint8_t RESERVED1                       : 5;
    __IO uint8_t POUT6                      : 1;
    __IO uint8_t POUT7                      : 1;
} stc_port_podr14_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_poer0_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    __IO uint8_t POUTE2                     : 1;
    __IO uint8_t POUTE3                     : 1;
    __IO uint8_t POUTE4                     : 1;
    __IO uint8_t POUTE5                     : 1;
    __IO uint8_t POUTE6                     : 1;
    __IO uint8_t POUTE7                     : 1;
} stc_port_poer1_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    __IO uint8_t POUTE2                     : 1;
    __IO uint8_t POUTE3                     : 1;
    __IO uint8_t POUTE4                     : 1;
    __IO uint8_t POUTE5                     : 1;
    __IO uint8_t POUTE6                     : 1;
    __IO uint8_t POUTE7                     : 1;
} stc_port_poer2_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_poer3_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_poer4_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_poer5_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    __IO uint8_t POUTE2                     : 1;
    __IO uint8_t POUTE3                     : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_poer6_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    __IO uint8_t POUTE2                     : 1;
    __IO uint8_t POUTE3                     : 1;
    __IO uint8_t POUTE4                     : 1;
    __IO uint8_t POUTE5                     : 1;
    uint8_t RESERVED6                       : 2;
} stc_port_poer7_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    __IO uint8_t POUTE2                     : 1;
    __IO uint8_t POUTE3                     : 1;
    __IO uint8_t POUTE4                     : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_poer12_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    uint8_t RESERVED1                       : 6;
    __IO uint8_t POUTE7                     : 1;
} stc_port_poer13_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    uint8_t RESERVED1                       : 5;
    __IO uint8_t POUTE6                     : 1;
    __IO uint8_t POUTE7                     : 1;
} stc_port_poer14_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_posr0_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    __IO uint8_t POS2                       : 1;
    __IO uint8_t POS3                       : 1;
    __IO uint8_t POS4                       : 1;
    __IO uint8_t POS5                       : 1;
    __IO uint8_t POS6                       : 1;
    __IO uint8_t POS7                       : 1;
} stc_port_posr1_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    __IO uint8_t POS2                       : 1;
    __IO uint8_t POS3                       : 1;
    __IO uint8_t POS4                       : 1;
    __IO uint8_t POS5                       : 1;
    __IO uint8_t POS6                       : 1;
    __IO uint8_t POS7                       : 1;
} stc_port_posr2_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_posr3_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_posr4_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_posr5_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    __IO uint8_t POS2                       : 1;
    __IO uint8_t POS3                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_posr6_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    __IO uint8_t POS2                       : 1;
    __IO uint8_t POS3                       : 1;
    __IO uint8_t POS4                       : 1;
    __IO uint8_t POS5                       : 1;
    uint8_t RESERVED6                       : 2;
} stc_port_posr7_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    __IO uint8_t POS2                       : 1;
    __IO uint8_t POS3                       : 1;
    __IO uint8_t POS4                       : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_posr12_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    uint8_t RESERVED1                       : 6;
    __IO uint8_t POS7                       : 1;
} stc_port_posr13_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    uint8_t RESERVED1                       : 5;
    __IO uint8_t POS6                       : 1;
    __IO uint8_t POS7                       : 1;
} stc_port_posr14_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_porr0_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    __IO uint8_t POR2                       : 1;
    __IO uint8_t POR3                       : 1;
    __IO uint8_t POR4                       : 1;
    __IO uint8_t POR5                       : 1;
    __IO uint8_t POR6                       : 1;
    __IO uint8_t POR7                       : 1;
} stc_port_porr1_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    __IO uint8_t POR2                       : 1;
    __IO uint8_t POR3                       : 1;
    __IO uint8_t POR4                       : 1;
    __IO uint8_t POR5                       : 1;
    __IO uint8_t POR6                       : 1;
    __IO uint8_t POR7                       : 1;
} stc_port_porr2_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_porr3_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_porr4_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_porr5_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    __IO uint8_t POR2                       : 1;
    __IO uint8_t POR3                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_porr6_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    __IO uint8_t POR2                       : 1;
    __IO uint8_t POR3                       : 1;
    __IO uint8_t POR4                       : 1;
    __IO uint8_t POR5                       : 1;
    uint8_t RESERVED6                       : 2;
} stc_port_porr7_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    __IO uint8_t POR2                       : 1;
    __IO uint8_t POR3                       : 1;
    __IO uint8_t POR4                       : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_porr12_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    uint8_t RESERVED1                       : 6;
    __IO uint8_t POR7                       : 1;
} stc_port_porr13_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    uint8_t RESERVED1                       : 5;
    __IO uint8_t POR6                       : 1;
    __IO uint8_t POR7                       : 1;
} stc_port_porr14_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    __IO uint8_t POT1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_potr0_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    __IO uint8_t POT1                       : 1;
    __IO uint8_t POT2                       : 1;
    __IO uint8_t POT3                       : 1;
    __IO uint8_t POT4                       : 1;
    __IO uint8_t POT5                       : 1;
    __IO uint8_t POT6                       : 1;
    __IO uint8_t POT7                       : 1;
} stc_port_potr1_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    __IO uint8_t POT1                       : 1;
    __IO uint8_t POT2                       : 1;
    __IO uint8_t POT3                       : 1;
    __IO uint8_t POT4                       : 1;
    __IO uint8_t POT5                       : 1;
    __IO uint8_t POT6                       : 1;
    __IO uint8_t POT7                       : 1;
} stc_port_potr2_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    __IO uint8_t POT1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_potr3_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    __IO uint8_t POT1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_potr4_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    __IO uint8_t POT1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_potr5_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    __IO uint8_t POT1                       : 1;
    __IO uint8_t POT2                       : 1;
    __IO uint8_t POT3                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_potr6_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    __IO uint8_t POT1                       : 1;
    __IO uint8_t POT2                       : 1;
    __IO uint8_t POT3                       : 1;
    __IO uint8_t POT4                       : 1;
    __IO uint8_t POT5                       : 1;
    uint8_t RESERVED6                       : 2;
} stc_port_potr7_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    __IO uint8_t POT1                       : 1;
    __IO uint8_t POT2                       : 1;
    __IO uint8_t POT3                       : 1;
    __IO uint8_t POT4                       : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_potr12_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    uint8_t RESERVED1                       : 6;
    __IO uint8_t POT7                       : 1;
} stc_port_potr13_field_t;

typedef struct
{
    __IO uint8_t POT0                       : 1;
    uint8_t RESERVED1                       : 5;
    __IO uint8_t POT6                       : 1;
    __IO uint8_t POT7                       : 1;
} stc_port_potr14_field_t;

typedef struct
{
    __IO uint16_t POUT                      : 1;
    __IO uint16_t POUTE                     : 1;
    __IO uint16_t NOD                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t DRV                       : 1;
    __IO uint16_t LTE                       : 1;
    __IO uint16_t PUU                       : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t PIN                       : 1;
    __IO uint16_t INVE                      : 1;
    __IO uint16_t CINSEL                    : 1;
    __IO uint16_t INTE                      : 1;
    __IO uint16_t FSEL                      : 3;
    uint16_t RESERVED15                     : 1;
} stc_port_pcr_field_t;

typedef struct
{
    __IO uint16_t SPFE                      : 2;
    uint16_t RESERVED2                      :14;
} stc_port_pspcr_field_t;

typedef struct
{
    uint16_t RESERVED0                      :14;
    __IO uint16_t RDWT                      : 2;
} stc_port_pccr_field_t;

typedef struct
{
    __IO uint16_t PINAE0                    : 1;
    __IO uint16_t PINAE1                    : 1;
    __IO uint16_t PINAE2                    : 1;
    __IO uint16_t PINAE3                    : 1;
    __IO uint16_t PINAE4                    : 1;
    __IO uint16_t PINAE5                    : 1;
    __IO uint16_t PINAE6                    : 1;
    __IO uint16_t PINAE7                    : 1;
    uint16_t RESERVED8                      : 4;
    __IO uint16_t PINAE12                   : 1;
    __IO uint16_t PINAE13                   : 1;
    __IO uint16_t PINAE14                   : 1;
    uint16_t RESERVED15                     : 1;
} stc_port_pinaer_field_t;

typedef struct
{
    __IO uint16_t WE                        : 1;
    uint16_t RESERVED1                      : 7;
    __IO uint16_t WP                        : 8;
} stc_port_pwpr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 1;
    __IO uint8_t CKSHRC                     : 1;
    uint8_t RESERVED2                       : 1;
    __IO uint8_t HAPORDIS                   : 1;
    uint8_t RESERVED4                       : 3;
    __IO uint8_t STOP                       : 1;
} stc_pwc_stpmcr_field_t;

typedef struct
{
    __IO uint8_t PWDRV                      : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t PWMONSEL                   : 1;
    __IO uint8_t PWMONE                     : 1;
    __IO uint8_t LPDADJ                     : 1;
    uint8_t RESERVED7                       : 1;
} stc_pwc_pwrc_field_t;

typedef struct
{
    __IO uint8_t RPRTA                      : 2;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t RPERDIS                    : 1;
    __IO uint8_t RPEF                       : 1;
    uint8_t RESERVED6                       : 2;
} stc_pwc_ramcr_field_t;

typedef struct
{
    __IO uint8_t EXVCCINEN                  : 1;
    uint8_t RESERVED1                       : 2;
    __IO uint8_t LVIF                       : 1;
    __IO uint8_t DETF                       : 1;
    uint8_t RESERVED5                       : 2;
    __IO uint8_t CMPOE                      : 1;
} stc_pwc_lvdcsr_field_t;

typedef struct
{
    __IO uint16_t CKRWE                     : 1;
    __IO uint16_t PWRWE                     : 1;
    __IO uint16_t FPRCB2                    : 1;
    __IO uint16_t LVRWE                     : 1;
    __IO uint16_t FPRCB4                    : 1;
    __IO uint16_t FPRCB5                    : 1;
    __IO uint16_t FPRCB6                    : 1;
    __IO uint16_t FPRCB7                    : 1;
    __IO uint16_t FPRCWE                    : 8;
} stc_pwc_fprc_field_t;

typedef struct
{
    __IO uint8_t DBGEN                      : 1;
    uint8_t RESERVED1                       : 7;
} stc_pwc_dbgc_field_t;

typedef struct
{
    __IO uint16_t PORF                      : 1;
    __IO uint16_t PINRF                     : 1;
    __IO uint16_t LVRF                      : 1;
    uint16_t RESERVED3                      : 2;
    __IO uint16_t WDRF                      : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t SWRF                      : 1;
    uint16_t RESERVED9                      : 1;
    __IO uint16_t RAMPERF                   : 1;
    uint16_t RESERVED11                     : 1;
    __IO uint16_t CPULKUPRF                 : 1;
    __IO uint16_t XTALERF                   : 1;
    __IO uint16_t MULTIRF                   : 1;
    __IO uint16_t CLRF                      : 1;
} stc_rmu_rstf0_field_t;

typedef struct
{
    __IO uint32_t SPD                       :16;
    uint32_t RESERVED16                     :16;
} stc_spi_dr_field_t;

typedef struct
{
    __IO uint32_t SPIMDS                    : 1;
    __IO uint32_t TXMDS                     : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t MSTR                      : 1;
    __IO uint32_t SPLPBK                    : 1;
    __IO uint32_t SPLPBK2                   : 1;
    __IO uint32_t SPE                       : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t EIE                       : 1;
    __IO uint32_t TXIE                      : 1;
    __IO uint32_t RXIE                      : 1;
    __IO uint32_t IDIE                      : 1;
    __IO uint32_t MODFE                     : 1;
    __IO uint32_t PATE                      : 1;
    __IO uint32_t PAOE                      : 1;
    __IO uint32_t PAE                       : 1;
    uint32_t RESERVED16                     :16;
} stc_spi_cr1_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 8;
    __IO uint32_t SS0PV                     : 1;
    uint32_t RESERVED9                      :23;
} stc_spi_cfg1_field_t;

typedef struct
{
    __IO uint32_t OVRERF                    : 1;
    __IO uint32_t IDLNF                     : 1;
    __IO uint32_t MODFERF                   : 1;
    __IO uint32_t PERF                      : 1;
    __IO uint32_t UDRERF                    : 1;
    __IO uint32_t TDEF                      : 1;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t RDFF                      : 1;
    uint32_t RESERVED8                      :24;
} stc_spi_sr_field_t;

typedef struct
{
    __IO uint32_t CPHA                      : 1;
    __IO uint32_t CPOL                      : 1;
    __IO uint32_t MBR                       : 3;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t DSIZE                     : 1;
    uint32_t RESERVED9                      : 3;
    __IO uint32_t LSBF                      : 1;
    uint32_t RESERVED13                     :19;
} stc_spi_cfg2_field_t;

typedef struct
{
    __IO uint32_t PERI                      : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t CKS                       : 4;
    __IO uint32_t WDPT                      : 4;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t SLPOFF                    : 1;
    uint32_t RESERVED17                     :14;
    __IO uint32_t ITS                       : 1;
} stc_swdt_cr_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
    __IO uint32_t UDF                       : 1;
    __IO uint32_t REF                       : 1;
    uint32_t RESERVED18                     :14;
} stc_swdt_sr_field_t;

typedef struct
{
    __IO uint32_t RF                        :16;
    uint32_t RESERVED16                     :16;
} stc_swdt_rr_field_t;

typedef struct
{
    __IO uint32_t CNTA                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr0_cntar_field_t;

typedef struct
{
    __IO uint32_t CMPA                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr0_cmpar_field_t;

typedef struct
{
    __IO uint32_t CSTA                      : 1;
    __IO uint32_t CAPMDA                    : 1;
    __IO uint32_t INTENA                    : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t CKDIVA                    : 4;
    __IO uint32_t SYNSA                     : 1;
    __IO uint32_t SYNCLKA                   : 1;
    __IO uint32_t ASYNCLKA                  : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t HSTAA                     : 1;
    __IO uint32_t HSTPA                     : 1;
    __IO uint32_t HCLEA                     : 1;
    __IO uint32_t HICPA                     : 1;
    uint32_t RESERVED16                     :16;
} stc_tmr0_bconr_field_t;

typedef struct
{
    __IO uint32_t CMFA                      : 1;
    uint32_t RESERVED1                      :31;
} stc_tmr0_stflr_field_t;

typedef struct
{
    __IO uint32_t CNTA                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr2_cntar_field_t;

