hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/mcu/common/hc32m120.h
/*  Bit definition for ADC_ICR register  */
#define ADC_ICR_EOCAIEN_POS                  (0U)
#define ADC_ICR_EOCAIEN                      ((uint8_t)0x01U)
#define ADC_ICR_EOCBIEN_POS                  (1U)
#define ADC_ICR_EOCBIEN                      ((uint8_t)0x02U)

/*  Bit definition for ADC_ISCLRR register  */
#define ADC_ISCLRR_CLREOCAF_POS              (0U)
#define ADC_ISCLRR_CLREOCAF                  ((uint8_t)0x01U)
#define ADC_ISCLRR_CLREOCBF_POS              (1U)
#define ADC_ISCLRR_CLREOCBF                  ((uint8_t)0x02U)

/*  Bit definition for ADC_DR0 register  */
#define ADC_DR0_DR0                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR1 register  */
#define ADC_DR1_DR1                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR2 register  */
#define ADC_DR2_DR2                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR3 register  */
#define ADC_DR3_DR3                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR4 register  */
#define ADC_DR4_DR4                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR5 register  */
#define ADC_DR5_DR5                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR6 register  */
#define ADC_DR6_DR6                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR7 register  */
#define ADC_DR7_DR7                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR8 register  */
#define ADC_DR8_DR8                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR9 register  */
#define ADC_DR9_DR9                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR10 register  */
#define ADC_DR10_DR10                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR11 register  */
#define ADC_DR11_DR11                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_AWDCR register  */
#define ADC_AWDCR_AWD0EN_POS                 (0U)
#define ADC_AWDCR_AWD0EN                     ((uint16_t)0x0001U)
#define ADC_AWDCR_AWD0IEN_POS                (1U)
#define ADC_AWDCR_AWD0IEN                    ((uint16_t)0x0002U)
#define ADC_AWDCR_AWD0MD_POS                 (2U)
#define ADC_AWDCR_AWD0MD                     ((uint16_t)0x0004U)
#define ADC_AWDCR_AWD1EN_POS                 (4U)
#define ADC_AWDCR_AWD1EN                     ((uint16_t)0x0010U)
#define ADC_AWDCR_AWD1IEN_POS                (5U)
#define ADC_AWDCR_AWD1IEN                    ((uint16_t)0x0020U)
#define ADC_AWDCR_AWD1MD_POS                 (6U)
#define ADC_AWDCR_AWD1MD                     ((uint16_t)0x0040U)
#define ADC_AWDCR_AWDCM_POS                  (8U)
#define ADC_AWDCR_AWDCM                      ((uint16_t)0x0300U)
#define ADC_AWDCR_AWDCM_0                    ((uint16_t)0x0100U)
#define ADC_AWDCR_AWDCM_1                    ((uint16_t)0x0200U)

/*  Bit definition for ADC_AWDSR register  */
#define ADC_AWDSR_AWD0F_POS                  (0U)
#define ADC_AWDSR_AWD0F                      ((uint8_t)0x01U)
#define ADC_AWDSR_AWD1F_POS                  (1U)
#define ADC_AWDSR_AWD1F                      ((uint8_t)0x02U)
#define ADC_AWDSR_AWDCMF_POS                 (4U)
#define ADC_AWDSR_AWDCMF                     ((uint8_t)0x10U)

/*  Bit definition for ADC_AWDSCLRR register  */
#define ADC_AWDSCLRR_CLRAWD0F_POS            (0U)
#define ADC_AWDSCLRR_CLRAWD0F                ((uint8_t)0x01U)
#define ADC_AWDSCLRR_CLRAWD1F_POS            (1U)
#define ADC_AWDSCLRR_CLRAWD1F                ((uint8_t)0x02U)
#define ADC_AWDSCLRR_CLRAWDCMF_POS           (4U)
#define ADC_AWDSCLRR_CLRAWDCMF               ((uint8_t)0x10U)

/*  Bit definition for ADC_AWD0DR0 register  */
#define ADC_AWD0DR0_AWD0DR0                  ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_AWD0DR1 register  */
#define ADC_AWD0DR1_AWD0DR1                  ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_AWD0CHSR register  */
#define ADC_AWD0CHSR_AWDCH_POS               (0U)
#define ADC_AWD0CHSR_AWDCH                   ((uint8_t)0x1FU)
#define ADC_AWD0CHSR_AWDCH_0                 ((uint8_t)0x01U)
#define ADC_AWD0CHSR_AWDCH_1                 ((uint8_t)0x02U)
#define ADC_AWD0CHSR_AWDCH_2                 ((uint8_t)0x04U)
#define ADC_AWD0CHSR_AWDCH_3                 ((uint8_t)0x08U)
#define ADC_AWD0CHSR_AWDCH_4                 ((uint8_t)0x10U)

/*  Bit definition for ADC_AWD1DR0 register  */
#define ADC_AWD1DR0_AWD1DR0                  ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_AWD1DR1 register  */
#define ADC_AWD1DR1_AWD1DR1                  ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_AWD1CHSR register  */
#define ADC_AWD1CHSR_AWDCH_POS               (0U)
#define ADC_AWD1CHSR_AWDCH                   ((uint8_t)0x1FU)
#define ADC_AWD1CHSR_AWDCH_0                 ((uint8_t)0x01U)
#define ADC_AWD1CHSR_AWDCH_1                 ((uint8_t)0x02U)
#define ADC_AWD1CHSR_AWDCH_2                 ((uint8_t)0x04U)
#define ADC_AWD1CHSR_AWDCH_3                 ((uint8_t)0x08U)
#define ADC_AWD1CHSR_AWDCH_4                 ((uint8_t)0x10U)

/*  Bit definition for ADC_OPACR register  */
#define ADC_OPACR_OPA1EN_POS                 (0U)
#define ADC_OPACR_OPA1EN                     ((uint16_t)0x0001U)
#define ADC_OPACR_OPA2EN_POS                 (1U)
#define ADC_OPACR_OPA2EN                     ((uint16_t)0x0002U)


/*******************************************************************************
                Bit definition for Peripheral AOS
*******************************************************************************/
/*  Bit definition for AOS_INTC_STRGCR register  */
#define AOS_INTC_STRGCR_STRG_POS             (0U)
#define AOS_INTC_STRGCR_STRG                 ((uint32_t)0x00000001U)

/*  Bit definition for AOS_EVPRT_CR register  */
#define AOS_EVPRT_CR_EVP1FEE_POS             (0U)
#define AOS_EVPRT_CR_EVP1FEE                 ((uint32_t)0x00000001U)
#define AOS_EVPRT_CR_EVP2FEE_POS             (1U)
#define AOS_EVPRT_CR_EVP2FEE                 ((uint32_t)0x00000002U)
#define AOS_EVPRT_CR_EVP3FEE_POS             (2U)
#define AOS_EVPRT_CR_EVP3FEE                 ((uint32_t)0x00000004U)
#define AOS_EVPRT_CR_EVP4FEE_POS             (3U)
#define AOS_EVPRT_CR_EVP4FEE                 ((uint32_t)0x00000008U)
#define AOS_EVPRT_CR_EVP1REE_POS             (4U)
#define AOS_EVPRT_CR_EVP1REE                 ((uint32_t)0x00000010U)
#define AOS_EVPRT_CR_EVP2REE_POS             (5U)
#define AOS_EVPRT_CR_EVP2REE                 ((uint32_t)0x00000020U)
#define AOS_EVPRT_CR_EVP3REE_POS             (6U)
#define AOS_EVPRT_CR_EVP3REE                 ((uint32_t)0x00000040U)
#define AOS_EVPRT_CR_EVP4REE_POS             (7U)
#define AOS_EVPRT_CR_EVP4REE                 ((uint32_t)0x00000080U)
#define AOS_EVPRT_CR_EVPDIVS_POS             (8U)
#define AOS_EVPRT_CR_EVPDIVS                 ((uint32_t)0x00000300U)
#define AOS_EVPRT_CR_EVPDIVS_0               ((uint32_t)0x00000100U)
#define AOS_EVPRT_CR_EVPDIVS_1               ((uint32_t)0x00000200U)
#define AOS_EVPRT_CR_EVPNFE_POS              (10U)
#define AOS_EVPRT_CR_EVPNFE                  ((uint32_t)0x00000400U)

