hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/mcu/common/hc32m120.h
/*  Bit definition for AOS_EVPRT_SR register  */
#define AOS_EVPRT_SR_PTSTS0_POS              (0U)
#define AOS_EVPRT_SR_PTSTS0                  ((uint32_t)0x0000000FU)
#define AOS_EVPRT_SR_PTSTS0_0                ((uint32_t)0x00000001U)
#define AOS_EVPRT_SR_PTSTS0_1                ((uint32_t)0x00000002U)
#define AOS_EVPRT_SR_PTSTS0_2                ((uint32_t)0x00000004U)
#define AOS_EVPRT_SR_PTSTS0_3                ((uint32_t)0x00000008U)
#define AOS_EVPRT_SR_PTSTS1_POS              (4U)
#define AOS_EVPRT_SR_PTSTS1                  ((uint32_t)0x000000F0U)
#define AOS_EVPRT_SR_PTSTS1_0                ((uint32_t)0x00000010U)
#define AOS_EVPRT_SR_PTSTS1_1                ((uint32_t)0x00000020U)
#define AOS_EVPRT_SR_PTSTS1_2                ((uint32_t)0x00000040U)
#define AOS_EVPRT_SR_PTSTS1_3                ((uint32_t)0x00000080U)
#define AOS_EVPRT_SR_PTSTS2_POS              (8U)
#define AOS_EVPRT_SR_PTSTS2                  ((uint32_t)0x00000F00U)
#define AOS_EVPRT_SR_PTSTS2_0                ((uint32_t)0x00000100U)
#define AOS_EVPRT_SR_PTSTS2_1                ((uint32_t)0x00000200U)
#define AOS_EVPRT_SR_PTSTS2_2                ((uint32_t)0x00000400U)
#define AOS_EVPRT_SR_PTSTS2_3                ((uint32_t)0x00000800U)
#define AOS_EVPRT_SR_PTSTS3_POS              (12U)
#define AOS_EVPRT_SR_PTSTS3                  ((uint32_t)0x0000F000U)
#define AOS_EVPRT_SR_PTSTS3_0                ((uint32_t)0x00001000U)
#define AOS_EVPRT_SR_PTSTS3_1                ((uint32_t)0x00002000U)
#define AOS_EVPRT_SR_PTSTS3_2                ((uint32_t)0x00004000U)
#define AOS_EVPRT_SR_PTSTS3_3                ((uint32_t)0x00008000U)

/*  Bit definition for AOS_TMR0_HTSSR register  */
#define AOS_TMR0_HTSSR_TRGSEL_POS            (0U)
#define AOS_TMR0_HTSSR_TRGSEL                ((uint32_t)0x0000007FU)
#define AOS_TMR0_HTSSR_TRGSEL_0              ((uint32_t)0x00000001U)
#define AOS_TMR0_HTSSR_TRGSEL_1              ((uint32_t)0x00000002U)
#define AOS_TMR0_HTSSR_TRGSEL_2              ((uint32_t)0x00000004U)
#define AOS_TMR0_HTSSR_TRGSEL_3              ((uint32_t)0x00000008U)
#define AOS_TMR0_HTSSR_TRGSEL_4              ((uint32_t)0x00000010U)
#define AOS_TMR0_HTSSR_TRGSEL_5              ((uint32_t)0x00000020U)
#define AOS_TMR0_HTSSR_TRGSEL_6              ((uint32_t)0x00000040U)

/*  Bit definition for AOS_TMR2_HTSSR register  */
#define AOS_TMR2_HTSSR_TRGSEL_POS            (0U)
#define AOS_TMR2_HTSSR_TRGSEL                ((uint32_t)0x0000007FU)
#define AOS_TMR2_HTSSR_TRGSEL_0              ((uint32_t)0x00000001U)
#define AOS_TMR2_HTSSR_TRGSEL_1              ((uint32_t)0x00000002U)
#define AOS_TMR2_HTSSR_TRGSEL_2              ((uint32_t)0x00000004U)
#define AOS_TMR2_HTSSR_TRGSEL_3              ((uint32_t)0x00000008U)
#define AOS_TMR2_HTSSR_TRGSEL_4              ((uint32_t)0x00000010U)
#define AOS_TMR2_HTSSR_TRGSEL_5              ((uint32_t)0x00000020U)
#define AOS_TMR2_HTSSR_TRGSEL_6              ((uint32_t)0x00000040U)

/*  Bit definition for AOS_TMRA_HTSSR register  */
#define AOS_TMRA_HTSSR_TRGSEL_POS            (0U)
#define AOS_TMRA_HTSSR_TRGSEL                ((uint32_t)0x0000007FU)
#define AOS_TMRA_HTSSR_TRGSEL_0              ((uint32_t)0x00000001U)
#define AOS_TMRA_HTSSR_TRGSEL_1              ((uint32_t)0x00000002U)
#define AOS_TMRA_HTSSR_TRGSEL_2              ((uint32_t)0x00000004U)
#define AOS_TMRA_HTSSR_TRGSEL_3              ((uint32_t)0x00000008U)
#define AOS_TMRA_HTSSR_TRGSEL_4              ((uint32_t)0x00000010U)
#define AOS_TMRA_HTSSR_TRGSEL_5              ((uint32_t)0x00000020U)
#define AOS_TMRA_HTSSR_TRGSEL_6              ((uint32_t)0x00000040U)

/*  Bit definition for AOS_TMRB_HTSSR register  */
#define AOS_TMRB_HTSSR_TRGSEL_POS            (0U)
#define AOS_TMRB_HTSSR_TRGSEL                ((uint32_t)0x0000007FU)
#define AOS_TMRB_HTSSR_TRGSEL_0              ((uint32_t)0x00000001U)
#define AOS_TMRB_HTSSR_TRGSEL_1              ((uint32_t)0x00000002U)
#define AOS_TMRB_HTSSR_TRGSEL_2              ((uint32_t)0x00000004U)
#define AOS_TMRB_HTSSR_TRGSEL_3              ((uint32_t)0x00000008U)
#define AOS_TMRB_HTSSR_TRGSEL_4              ((uint32_t)0x00000010U)
#define AOS_TMRB_HTSSR_TRGSEL_5              ((uint32_t)0x00000020U)
#define AOS_TMRB_HTSSR_TRGSEL_6              ((uint32_t)0x00000040U)

/*  Bit definition for AOS_ADC_ITRGSELR0 register  */
#define AOS_ADC_ITRGSELR0_TRGSEL_POS         (0U)
#define AOS_ADC_ITRGSELR0_TRGSEL             ((uint32_t)0x0000007FU)
#define AOS_ADC_ITRGSELR0_TRGSEL_0           ((uint32_t)0x00000001U)
#define AOS_ADC_ITRGSELR0_TRGSEL_1           ((uint32_t)0x00000002U)
#define AOS_ADC_ITRGSELR0_TRGSEL_2           ((uint32_t)0x00000004U)
#define AOS_ADC_ITRGSELR0_TRGSEL_3           ((uint32_t)0x00000008U)
#define AOS_ADC_ITRGSELR0_TRGSEL_4           ((uint32_t)0x00000010U)
#define AOS_ADC_ITRGSELR0_TRGSEL_5           ((uint32_t)0x00000020U)
#define AOS_ADC_ITRGSELR0_TRGSEL_6           ((uint32_t)0x00000040U)

/*  Bit definition for AOS_ADC_ITRGSELR1 register  */
#define AOS_ADC_ITRGSELR1_TRGSEL_POS         (0U)
#define AOS_ADC_ITRGSELR1_TRGSEL             ((uint32_t)0x0000007FU)
#define AOS_ADC_ITRGSELR1_TRGSEL_0           ((uint32_t)0x00000001U)
#define AOS_ADC_ITRGSELR1_TRGSEL_1           ((uint32_t)0x00000002U)
#define AOS_ADC_ITRGSELR1_TRGSEL_2           ((uint32_t)0x00000004U)
#define AOS_ADC_ITRGSELR1_TRGSEL_3           ((uint32_t)0x00000008U)
#define AOS_ADC_ITRGSELR1_TRGSEL_4           ((uint32_t)0x00000010U)
#define AOS_ADC_ITRGSELR1_TRGSEL_5           ((uint32_t)0x00000020U)
#define AOS_ADC_ITRGSELR1_TRGSEL_6           ((uint32_t)0x00000040U)

/*  Bit definition for AOS_DMA0_TRGSEL register  */
#define AOS_DMA0_TRGSEL_TRGSEL_POS           (0U)
#define AOS_DMA0_TRGSEL_TRGSEL               ((uint32_t)0x0000007FU)
#define AOS_DMA0_TRGSEL_TRGSEL_0             ((uint32_t)0x00000001U)
#define AOS_DMA0_TRGSEL_TRGSEL_1             ((uint32_t)0x00000002U)
#define AOS_DMA0_TRGSEL_TRGSEL_2             ((uint32_t)0x00000004U)
#define AOS_DMA0_TRGSEL_TRGSEL_3             ((uint32_t)0x00000008U)
#define AOS_DMA0_TRGSEL_TRGSEL_4             ((uint32_t)0x00000010U)
#define AOS_DMA0_TRGSEL_TRGSEL_5             ((uint32_t)0x00000020U)
#define AOS_DMA0_TRGSEL_TRGSEL_6             ((uint32_t)0x00000040U)

/*  Bit definition for AOS_DMA1_TRGSEL register  */
#define AOS_DMA1_TRGSEL_TRGSEL_POS           (0U)
#define AOS_DMA1_TRGSEL_TRGSEL               ((uint32_t)0x0000007FU)
#define AOS_DMA1_TRGSEL_TRGSEL_0             ((uint32_t)0x00000001U)
#define AOS_DMA1_TRGSEL_TRGSEL_1             ((uint32_t)0x00000002U)
#define AOS_DMA1_TRGSEL_TRGSEL_2             ((uint32_t)0x00000004U)
#define AOS_DMA1_TRGSEL_TRGSEL_3             ((uint32_t)0x00000008U)
#define AOS_DMA1_TRGSEL_TRGSEL_4             ((uint32_t)0x00000010U)
#define AOS_DMA1_TRGSEL_TRGSEL_5             ((uint32_t)0x00000020U)
#define AOS_DMA1_TRGSEL_TRGSEL_6             ((uint32_t)0x00000040U)


