hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/mcu/common/hc32m120.h
/*  Bit definition for EFM_LVDICGCR register  */
#define EFM_LVDICGCR_DFS_POS                 (0U)
#define EFM_LVDICGCR_DFS                     ((uint16_t)0x0003U)
#define EFM_LVDICGCR_DFS_0                   ((uint16_t)0x0001U)
#define EFM_LVDICGCR_DFS_1                   ((uint16_t)0x0002U)
#define EFM_LVDICGCR_DFDIS_POS               (2U)
#define EFM_LVDICGCR_DFDIS                   ((uint16_t)0x0004U)
#define EFM_LVDICGCR_LVDLVL_POS              (8U)
#define EFM_LVDICGCR_LVDLVL                  ((uint16_t)0x0F00U)
#define EFM_LVDICGCR_LVDLVL_0                ((uint16_t)0x0100U)
#define EFM_LVDICGCR_LVDLVL_1                ((uint16_t)0x0200U)
#define EFM_LVDICGCR_LVDLVL_2                ((uint16_t)0x0400U)
#define EFM_LVDICGCR_LVDLVL_3                ((uint16_t)0x0800U)
#define EFM_LVDICGCR_NMIS_POS                (12U)
#define EFM_LVDICGCR_NMIS                    ((uint16_t)0x1000U)
#define EFM_LVDICGCR_IRS_POS                 (13U)
#define EFM_LVDICGCR_IRS                     ((uint16_t)0x2000U)
#define EFM_LVDICGCR_IRDIS_POS               (14U)
#define EFM_LVDICGCR_IRDIS                   ((uint16_t)0x4000U)
#define EFM_LVDICGCR_LVDDIS_POS              (15U)
#define EFM_LVDICGCR_LVDDIS                  ((uint16_t)0x8000U)


/*******************************************************************************
                Bit definition for Peripheral EMB
*******************************************************************************/
/*  Bit definition for EMB_CTL register  */
#define EMB_CTL_PORTINEN_POS                 (0U)
#define EMB_CTL_PORTINEN                     ((uint32_t)0x00000001U)
#define EMB_CTL_CMPEN_POS                    (1U)
#define EMB_CTL_CMPEN                        ((uint32_t)0x00000006U)
#define EMB_CTL_CMPEN_0                      ((uint32_t)0x00000002U)
#define EMB_CTL_CMPEN_1                      ((uint32_t)0x00000004U)
#define EMB_CTL_OSCSTPEN_POS                 (5U)
#define EMB_CTL_OSCSTPEN                     ((uint32_t)0x00000020U)
#define EMB_CTL_PWMSEL_POS                   (6U)
#define EMB_CTL_PWMSEL                       ((uint32_t)0x000001C0U)
#define EMB_CTL_PWMSEL_0                     ((uint32_t)0x00000040U)
#define EMB_CTL_PWMSEL_1                     ((uint32_t)0x00000080U)
#define EMB_CTL_PWMSEL_2                     ((uint32_t)0x00000100U)
#define EMB_CTL_NFSEL_POS                    (28U)
#define EMB_CTL_NFSEL                        ((uint32_t)0x30000000U)
#define EMB_CTL_NFSEL_0                      ((uint32_t)0x10000000U)
#define EMB_CTL_NFSEL_1                      ((uint32_t)0x20000000U)
#define EMB_CTL_NFEN_POS                     (30U)
#define EMB_CTL_NFEN                         ((uint32_t)0x40000000U)
#define EMB_CTL_INVSEL_POS                   (31U)
#define EMB_CTL_INVSEL                       ((uint32_t)0x80000000U)

/*  Bit definition for EMB_PWMLV register  */
#define EMB_PWMLV_PWMLV_POS                  (0U)
#define EMB_PWMLV_PWMLV                      ((uint32_t)0x00000007U)
#define EMB_PWMLV_PWMLV_0                    ((uint32_t)0x00000001U)
#define EMB_PWMLV_PWMLV_1                    ((uint32_t)0x00000002U)
#define EMB_PWMLV_PWMLV_2                    ((uint32_t)0x00000004U)

/*  Bit definition for EMB_SOE register  */
#define EMB_SOE_SOE_POS                      (0U)
#define EMB_SOE_SOE                          ((uint32_t)0x00000001U)

/*  Bit definition for EMB_STAT register  */
#define EMB_STAT_PORTINF_POS                 (0U)
#define EMB_STAT_PORTINF                     ((uint32_t)0x00000001U)
#define EMB_STAT_PWMSF_POS                   (1U)
#define EMB_STAT_PWMSF                       ((uint32_t)0x00000002U)
#define EMB_STAT_CMPF_POS                    (2U)
#define EMB_STAT_CMPF                        ((uint32_t)0x00000004U)
#define EMB_STAT_OSF_POS                     (3U)
#define EMB_STAT_OSF                         ((uint32_t)0x00000008U)
#define EMB_STAT_PORTINST_POS                (4U)
#define EMB_STAT_PORTINST                    ((uint32_t)0x00000010U)
#define EMB_STAT_PWMST_POS                   (5U)
#define EMB_STAT_PWMST                       ((uint32_t)0x00000020U)

/*  Bit definition for EMB_STATCLR register  */
#define EMB_STATCLR_PORTINFCLR_POS           (0U)
#define EMB_STATCLR_PORTINFCLR               ((uint32_t)0x00000001U)
#define EMB_STATCLR_PWMSFCLR_POS             (1U)
#define EMB_STATCLR_PWMSFCLR                 ((uint32_t)0x00000002U)
#define EMB_STATCLR_CMPFCLR_POS              (2U)
#define EMB_STATCLR_CMPFCLR                  ((uint32_t)0x00000004U)
#define EMB_STATCLR_OSFCLR_POS               (3U)
#define EMB_STATCLR_OSFCLR                   ((uint32_t)0x00000008U)

/*  Bit definition for EMB_INTEN register  */
#define EMB_INTEN_PORTINTEN_POS              (0U)
#define EMB_INTEN_PORTINTEN                  ((uint32_t)0x00000001U)
#define EMB_INTEN_PWMINTEN_POS               (1U)
#define EMB_INTEN_PWMINTEN                   ((uint32_t)0x00000002U)
#define EMB_INTEN_CMPINTEN_POS               (2U)
#define EMB_INTEN_CMPINTEN                   ((uint32_t)0x00000004U)
#define EMB_INTEN_OSINTEN_POS                (3U)
#define EMB_INTEN_OSINTEN                    ((uint32_t)0x00000008U)


/*******************************************************************************
                Bit definition for Peripheral I2C
*******************************************************************************/
/*  Bit definition for I2C_CR1 register  */
#define I2C_CR1_PE_POS                       (0U)
#define I2C_CR1_PE                           ((uint32_t)0x00000001U)
#define I2C_CR1_SMBUS_POS                    (1U)
#define I2C_CR1_SMBUS                        ((uint32_t)0x00000002U)
#define I2C_CR1_SMBALRTEN_POS                (2U)
#define I2C_CR1_SMBALRTEN                    ((uint32_t)0x00000004U)
#define I2C_CR1_SMBDEFAULTEN_POS             (3U)
#define I2C_CR1_SMBDEFAULTEN                 ((uint32_t)0x00000008U)
#define I2C_CR1_SMBHOSTEN_POS                (4U)
#define I2C_CR1_SMBHOSTEN                    ((uint32_t)0x00000010U)
#define I2C_CR1_FACKEN_POS                   (5U)
#define I2C_CR1_FACKEN                       ((uint32_t)0x00000020U)
#define I2C_CR1_GCEN_POS                     (6U)
#define I2C_CR1_GCEN                         ((uint32_t)0x00000040U)
#define I2C_CR1_RESTART_POS                  (7U)
#define I2C_CR1_RESTART                      ((uint32_t)0x00000080U)
#define I2C_CR1_START_POS                    (8U)
#define I2C_CR1_START                        ((uint32_t)0x00000100U)
#define I2C_CR1_STOP_POS                     (9U)
#define I2C_CR1_STOP                         ((uint32_t)0x00000200U)
#define I2C_CR1_ACK_POS                      (10U)
#define I2C_CR1_ACK                          ((uint32_t)0x00000400U)
#define I2C_CR1_SWRST_POS                    (15U)
#define I2C_CR1_SWRST                        ((uint32_t)0x00008000U)

/*  Bit definition for I2C_CR2 register  */
#define I2C_CR2_STARTIE_POS                  (0U)
#define I2C_CR2_STARTIE                      ((uint32_t)0x00000001U)
#define I2C_CR2_SLADDR0IE_POS                (1U)
#define I2C_CR2_SLADDR0IE                    ((uint32_t)0x00000002U)
#define I2C_CR2_SLADDR1IE_POS                (2U)
#define I2C_CR2_SLADDR1IE                    ((uint32_t)0x00000004U)
#define I2C_CR2_TENDIE_POS                   (3U)
#define I2C_CR2_TENDIE                       ((uint32_t)0x00000008U)
#define I2C_CR2_STOPIE_POS                   (4U)
#define I2C_CR2_STOPIE                       ((uint32_t)0x00000010U)
#define I2C_CR2_RFULLIE_POS                  (6U)
#define I2C_CR2_RFULLIE                      ((uint32_t)0x00000040U)
#define I2C_CR2_TEMPTYIE_POS                 (7U)
#define I2C_CR2_TEMPTYIE                     ((uint32_t)0x00000080U)
#define I2C_CR2_ARLOIE_POS                   (9U)
#define I2C_CR2_ARLOIE                       ((uint32_t)0x00000200U)
#define I2C_CR2_NACKIE_POS                   (12U)
#define I2C_CR2_NACKIE                       ((uint32_t)0x00001000U)
#define I2C_CR2_GENCALLIE_POS                (20U)
#define I2C_CR2_GENCALLIE                    ((uint32_t)0x00100000U)
#define I2C_CR2_SMBDEFAULTIE_POS             (21U)
#define I2C_CR2_SMBDEFAULTIE                 ((uint32_t)0x00200000U)
#define I2C_CR2_SMBHOSTIE_POS                (22U)
#define I2C_CR2_SMBHOSTIE                    ((uint32_t)0x00400000U)
#define I2C_CR2_SMBALRTIE_POS                (23U)
#define I2C_CR2_SMBALRTIE                    ((uint32_t)0x00800000U)

/*  Bit definition for I2C_SLR0 register  */
#define I2C_SLR0_SLADDR0_POS                 (0U)
#define I2C_SLR0_SLADDR0                     ((uint32_t)0x000003FFU)
#define I2C_SLR0_SLADDR0_0                   ((uint32_t)0x00000001U)
#define I2C_SLR0_SLADDR0_1                   ((uint32_t)0x00000002U)
#define I2C_SLR0_SLADDR0_2                   ((uint32_t)0x00000004U)
#define I2C_SLR0_SLADDR0_3                   ((uint32_t)0x00000008U)
#define I2C_SLR0_SLADDR0_4                   ((uint32_t)0x00000010U)
#define I2C_SLR0_SLADDR0_5                   ((uint32_t)0x00000020U)
#define I2C_SLR0_SLADDR0_6                   ((uint32_t)0x00000040U)
#define I2C_SLR0_SLADDR0_7                   ((uint32_t)0x00000080U)
#define I2C_SLR0_SLADDR0_8                   ((uint32_t)0x00000100U)
#define I2C_SLR0_SLADDR0_9                   ((uint32_t)0x00000200U)
#define I2C_SLR0_SLADDR0EN_POS               (12U)
#define I2C_SLR0_SLADDR0EN                   ((uint32_t)0x00001000U)
#define I2C_SLR0_ADDRMOD0_POS                (15U)
#define I2C_SLR0_ADDRMOD0                    ((uint32_t)0x00008000U)

