hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/mcu/common/hc32m120.h
/*  Bit definition for INTC_EVTER register  */
#define INTC_EVTER_EVTEN0_POS                (0U)
#define INTC_EVTER_EVTEN0                    ((uint32_t)0x00000001U)
#define INTC_EVTER_EVTEN1_POS                (1U)
#define INTC_EVTER_EVTEN1                    ((uint32_t)0x00000002U)
#define INTC_EVTER_EVTEN2_POS                (2U)
#define INTC_EVTER_EVTEN2                    ((uint32_t)0x00000004U)
#define INTC_EVTER_EVTEN3_POS                (3U)
#define INTC_EVTER_EVTEN3                    ((uint32_t)0x00000008U)
#define INTC_EVTER_EVTEN4_POS                (4U)
#define INTC_EVTER_EVTEN4                    ((uint32_t)0x00000010U)
#define INTC_EVTER_EVTEN5_POS                (5U)
#define INTC_EVTER_EVTEN5                    ((uint32_t)0x00000020U)
#define INTC_EVTER_EVTEN6_POS                (6U)
#define INTC_EVTER_EVTEN6                    ((uint32_t)0x00000040U)
#define INTC_EVTER_EVTEN7_POS                (7U)
#define INTC_EVTER_EVTEN7                    ((uint32_t)0x00000080U)

/*  Bit definition for INTC_EKEYCR register  */
#define INTC_EKEYCR_EKEY0EN_POS              (0U)
#define INTC_EKEYCR_EKEY0EN                  ((uint32_t)0x00000001U)
#define INTC_EKEYCR_EKEY1EN_POS              (1U)
#define INTC_EKEYCR_EKEY1EN                  ((uint32_t)0x00000002U)
#define INTC_EKEYCR_EKEY2EN_POS              (2U)
#define INTC_EKEYCR_EKEY2EN                  ((uint32_t)0x00000004U)
#define INTC_EKEYCR_EKEY3EN_POS              (3U)
#define INTC_EKEYCR_EKEY3EN                  ((uint32_t)0x00000008U)
#define INTC_EKEYCR_EKEY4EN_POS              (4U)
#define INTC_EKEYCR_EKEY4EN                  ((uint32_t)0x00000010U)
#define INTC_EKEYCR_EKEY5EN_POS              (5U)
#define INTC_EKEYCR_EKEY5EN                  ((uint32_t)0x00000020U)

/*  Bit definition for INTC_FPRCR register  */
#define INTC_FPRCR_FPRC_POS                  (0U)
#define INTC_FPRCR_FPRC                      ((uint32_t)0x000000FFU)
#define INTC_FPRCR_FPRC_0                    ((uint32_t)0x00000001U)
#define INTC_FPRCR_FPRC_1                    ((uint32_t)0x00000002U)
#define INTC_FPRCR_FPRC_2                    ((uint32_t)0x00000004U)
#define INTC_FPRCR_FPRC_3                    ((uint32_t)0x00000008U)
#define INTC_FPRCR_FPRC_4                    ((uint32_t)0x00000010U)
#define INTC_FPRCR_FPRC_5                    ((uint32_t)0x00000020U)
#define INTC_FPRCR_FPRC_6                    ((uint32_t)0x00000040U)
#define INTC_FPRCR_FPRC_7                    ((uint32_t)0x00000080U)

/*  Bit definition for INTC_EIRQCR register  */
#define INTC_EIRQCR_EIRQTRG_POS              (0U)
#define INTC_EIRQCR_EIRQTRG                  ((uint32_t)0x00000003U)
#define INTC_EIRQCR_EIRQTRG_0                ((uint32_t)0x00000001U)
#define INTC_EIRQCR_EIRQTRG_1                ((uint32_t)0x00000002U)
#define INTC_EIRQCR_EIRQFCLK_POS             (4U)
#define INTC_EIRQCR_EIRQFCLK                 ((uint32_t)0x00000030U)
#define INTC_EIRQCR_EIRQFCLK_0               ((uint32_t)0x00000010U)
#define INTC_EIRQCR_EIRQFCLK_1               ((uint32_t)0x00000020U)
#define INTC_EIRQCR_EIRQFEN_POS              (7U)
#define INTC_EIRQCR_EIRQFEN                  ((uint32_t)0x00000080U)

/*  Bit definition for INTC_WUPENR register  */
#define INTC_WUPENR_EIRQWUEN_POS             (0U)
#define INTC_WUPENR_EIRQWUEN                 ((uint32_t)0x000003FFU)
#define INTC_WUPENR_EIRQWUEN_0               ((uint32_t)0x00000001U)
#define INTC_WUPENR_EIRQWUEN_1               ((uint32_t)0x00000002U)
#define INTC_WUPENR_EIRQWUEN_2               ((uint32_t)0x00000004U)
#define INTC_WUPENR_EIRQWUEN_3               ((uint32_t)0x00000008U)
#define INTC_WUPENR_EIRQWUEN_4               ((uint32_t)0x00000010U)
#define INTC_WUPENR_EIRQWUEN_5               ((uint32_t)0x00000020U)
#define INTC_WUPENR_EIRQWUEN_6               ((uint32_t)0x00000040U)
#define INTC_WUPENR_EIRQWUEN_7               ((uint32_t)0x00000080U)
#define INTC_WUPENR_EIRQWUEN_8               ((uint32_t)0x00000100U)
#define INTC_WUPENR_EIRQWUEN_9               ((uint32_t)0x00000200U)
#define INTC_WUPENR_SWDTWUEN_POS             (16U)
#define INTC_WUPENR_SWDTWUEN                 ((uint32_t)0x00010000U)
#define INTC_WUPENR_EKEYWUEN_POS             (17U)
#define INTC_WUPENR_EKEYWUEN                 ((uint32_t)0x00020000U)
#define INTC_WUPENR_TMR0CMPWUEN_POS          (18U)
#define INTC_WUPENR_TMR0CMPWUEN              ((uint32_t)0x00040000U)
#define INTC_WUPENR_TMR2CMPWUEN_POS          (19U)
#define INTC_WUPENR_TMR2CMPWUEN              ((uint32_t)0x00080000U)
#define INTC_WUPENR_TMR2OVFWUEN_POS          (20U)
#define INTC_WUPENR_TMR2OVFWUEN              ((uint32_t)0x00100000U)
#define INTC_WUPENR_CMPWUEN_POS              (21U)
#define INTC_WUPENR_CMPWUEN                  ((uint32_t)0x00200000U)
#define INTC_WUPENR_PVDWUEN_POS              (22U)
#define INTC_WUPENR_PVDWUEN                  ((uint32_t)0x00400000U)

/*  Bit definition for INTC_EIRQFR register  */
#define INTC_EIRQFR_EIRQF_POS                (0U)
#define INTC_EIRQFR_EIRQF                    ((uint32_t)0x000003FFU)
#define INTC_EIRQFR_EIRQF_0                  ((uint32_t)0x00000001U)
#define INTC_EIRQFR_EIRQF_1                  ((uint32_t)0x00000002U)
#define INTC_EIRQFR_EIRQF_2                  ((uint32_t)0x00000004U)
#define INTC_EIRQFR_EIRQF_3                  ((uint32_t)0x00000008U)
#define INTC_EIRQFR_EIRQF_4                  ((uint32_t)0x00000010U)
#define INTC_EIRQFR_EIRQF_5                  ((uint32_t)0x00000020U)
#define INTC_EIRQFR_EIRQF_6                  ((uint32_t)0x00000040U)
#define INTC_EIRQFR_EIRQF_7                  ((uint32_t)0x00000080U)
#define INTC_EIRQFR_EIRQF_8                  ((uint32_t)0x00000100U)
#define INTC_EIRQFR_EIRQF_9                  ((uint32_t)0x00000200U)

/*  Bit definition for INTC_EIRQCLR register  */
#define INTC_EIRQCLR_EIRQCL_POS              (0U)
#define INTC_EIRQCLR_EIRQCL                  ((uint32_t)0x000003FFU)
#define INTC_EIRQCLR_EIRQCL_0                ((uint32_t)0x00000001U)
#define INTC_EIRQCLR_EIRQCL_1                ((uint32_t)0x00000002U)
#define INTC_EIRQCLR_EIRQCL_2                ((uint32_t)0x00000004U)
#define INTC_EIRQCLR_EIRQCL_3                ((uint32_t)0x00000008U)
#define INTC_EIRQCLR_EIRQCL_4                ((uint32_t)0x00000010U)
#define INTC_EIRQCLR_EIRQCL_5                ((uint32_t)0x00000020U)
#define INTC_EIRQCLR_EIRQCL_6                ((uint32_t)0x00000040U)
#define INTC_EIRQCLR_EIRQCL_7                ((uint32_t)0x00000080U)
#define INTC_EIRQCLR_EIRQCL_8                ((uint32_t)0x00000100U)
#define INTC_EIRQCLR_EIRQCL_9                ((uint32_t)0x00000200U)

