hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/mcu/common/hc32m120.h
/*  Bit definition for TMR4_SCCRUL register  */
#define TMR4_SCCRUL_SCCRUL                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_SCCRVH register  */
#define TMR4_SCCRVH_SCCRVH                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_SCCRVL register  */
#define TMR4_SCCRVL_SCCRVL                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_SCCRWH register  */
#define TMR4_SCCRWH_SCCRWH                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_SCCRWL register  */
#define TMR4_SCCRWL_SCCRWL                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_SCSR register  */
#define TMR4_SCSR_BUFEN_POS                  (0U)
#define TMR4_SCSR_BUFEN                      ((uint16_t)0x0003U)
#define TMR4_SCSR_BUFEN_0                    ((uint16_t)0x0001U)
#define TMR4_SCSR_BUFEN_1                    ((uint16_t)0x0002U)
#define TMR4_SCSR_EVTOS_POS                  (2U)
#define TMR4_SCSR_EVTOS                      ((uint16_t)0x001CU)
#define TMR4_SCSR_EVTOS_0                    ((uint16_t)0x0004U)
#define TMR4_SCSR_EVTOS_1                    ((uint16_t)0x0008U)
#define TMR4_SCSR_EVTOS_2                    ((uint16_t)0x0010U)
#define TMR4_SCSR_LMC_POS                    (5U)
#define TMR4_SCSR_LMC                        ((uint16_t)0x0020U)
#define TMR4_SCSR_EVTMS_POS                  (8U)
#define TMR4_SCSR_EVTMS                      ((uint16_t)0x0100U)
#define TMR4_SCSR_EVTDS_POS                  (9U)
#define TMR4_SCSR_EVTDS                      ((uint16_t)0x0200U)
#define TMR4_SCSR_DEN_POS                    (12U)
#define TMR4_SCSR_DEN                        ((uint16_t)0x1000U)
#define TMR4_SCSR_PEN_POS                    (13U)
#define TMR4_SCSR_PEN                        ((uint16_t)0x2000U)
#define TMR4_SCSR_UEN_POS                    (14U)
#define TMR4_SCSR_UEN                        ((uint16_t)0x4000U)
#define TMR4_SCSR_ZEN_POS                    (15U)
#define TMR4_SCSR_ZEN                        ((uint16_t)0x8000U)

/*  Bit definition for TMR4_SCMR register  */
#define TMR4_SCMR_AMC_POS                    (0U)
#define TMR4_SCMR_AMC                        ((uint16_t)0x000FU)
#define TMR4_SCMR_AMC_0                      ((uint16_t)0x0001U)
#define TMR4_SCMR_AMC_1                      ((uint16_t)0x0002U)
#define TMR4_SCMR_AMC_2                      ((uint16_t)0x0004U)
#define TMR4_SCMR_AMC_3                      ((uint16_t)0x0008U)
#define TMR4_SCMR_MZCE_POS                   (6U)
#define TMR4_SCMR_MZCE                       ((uint16_t)0x0040U)
#define TMR4_SCMR_MPCE_POS                   (7U)
#define TMR4_SCMR_MPCE                       ((uint16_t)0x0080U)

/*  Bit definition for TMR4_ECSR register  */
#define TMR4_ECSR_EMBVAL_POS                 (0U)
#define TMR4_ECSR_EMBVAL                     ((uint32_t)0x00000007U)
#define TMR4_ECSR_EMBVAL_0                   ((uint32_t)0x00000001U)
#define TMR4_ECSR_EMBVAL_1                   ((uint32_t)0x00000002U)
#define TMR4_ECSR_EMBVAL_2                   ((uint32_t)0x00000004U)


/*******************************************************************************
                Bit definition for Peripheral TMRA
*******************************************************************************/
/*  Bit definition for TMRA_CNTER register  */
#define TMRA_CNTER_CNT_POS                   (0U)
#define TMRA_CNTER_CNT                       ((uint16_t)0xFFFFU)
#define TMRA_CNTER_CNT_0                     ((uint16_t)0x0001U)
#define TMRA_CNTER_CNT_1                     ((uint16_t)0x0002U)
#define TMRA_CNTER_CNT_2                     ((uint16_t)0x0004U)
#define TMRA_CNTER_CNT_3                     ((uint16_t)0x0008U)
#define TMRA_CNTER_CNT_4                     ((uint16_t)0x0010U)
#define TMRA_CNTER_CNT_5                     ((uint16_t)0x0020U)
#define TMRA_CNTER_CNT_6                     ((uint16_t)0x0040U)
#define TMRA_CNTER_CNT_7                     ((uint16_t)0x0080U)
#define TMRA_CNTER_CNT_8                     ((uint16_t)0x0100U)
#define TMRA_CNTER_CNT_9                     ((uint16_t)0x0200U)
#define TMRA_CNTER_CNT_10                    ((uint16_t)0x0400U)
#define TMRA_CNTER_CNT_11                    ((uint16_t)0x0800U)
#define TMRA_CNTER_CNT_12                    ((uint16_t)0x1000U)
#define TMRA_CNTER_CNT_13                    ((uint16_t)0x2000U)
#define TMRA_CNTER_CNT_14                    ((uint16_t)0x4000U)
#define TMRA_CNTER_CNT_15                    ((uint16_t)0x8000U)

/*  Bit definition for TMRA_PERAR register  */
#define TMRA_PERAR_PER_POS                   (0U)
#define TMRA_PERAR_PER                       ((uint16_t)0xFFFFU)
#define TMRA_PERAR_PER_0                     ((uint16_t)0x0001U)
#define TMRA_PERAR_PER_1                     ((uint16_t)0x0002U)
#define TMRA_PERAR_PER_2                     ((uint16_t)0x0004U)
#define TMRA_PERAR_PER_3                     ((uint16_t)0x0008U)
#define TMRA_PERAR_PER_4                     ((uint16_t)0x0010U)
#define TMRA_PERAR_PER_5                     ((uint16_t)0x0020U)
#define TMRA_PERAR_PER_6                     ((uint16_t)0x0040U)
#define TMRA_PERAR_PER_7                     ((uint16_t)0x0080U)
#define TMRA_PERAR_PER_8                     ((uint16_t)0x0100U)
#define TMRA_PERAR_PER_9                     ((uint16_t)0x0200U)
#define TMRA_PERAR_PER_10                    ((uint16_t)0x0400U)
#define TMRA_PERAR_PER_11                    ((uint16_t)0x0800U)
#define TMRA_PERAR_PER_12                    ((uint16_t)0x1000U)
#define TMRA_PERAR_PER_13                    ((uint16_t)0x2000U)
#define TMRA_PERAR_PER_14                    ((uint16_t)0x4000U)
#define TMRA_PERAR_PER_15                    ((uint16_t)0x8000U)

/*  Bit definition for TMRA_CMPAR1 register  */
#define TMRA_CMPAR1_CMP_POS                  (0U)
#define TMRA_CMPAR1_CMP                      ((uint16_t)0xFFFFU)
#define TMRA_CMPAR1_CMP_0                    ((uint16_t)0x0001U)
#define TMRA_CMPAR1_CMP_1                    ((uint16_t)0x0002U)
#define TMRA_CMPAR1_CMP_2                    ((uint16_t)0x0004U)
#define TMRA_CMPAR1_CMP_3                    ((uint16_t)0x0008U)
#define TMRA_CMPAR1_CMP_4                    ((uint16_t)0x0010U)
#define TMRA_CMPAR1_CMP_5                    ((uint16_t)0x0020U)
#define TMRA_CMPAR1_CMP_6                    ((uint16_t)0x0040U)
#define TMRA_CMPAR1_CMP_7                    ((uint16_t)0x0080U)
#define TMRA_CMPAR1_CMP_8                    ((uint16_t)0x0100U)
#define TMRA_CMPAR1_CMP_9                    ((uint16_t)0x0200U)
#define TMRA_CMPAR1_CMP_10                   ((uint16_t)0x0400U)
#define TMRA_CMPAR1_CMP_11                   ((uint16_t)0x0800U)
#define TMRA_CMPAR1_CMP_12                   ((uint16_t)0x1000U)
#define TMRA_CMPAR1_CMP_13                   ((uint16_t)0x2000U)
#define TMRA_CMPAR1_CMP_14                   ((uint16_t)0x4000U)
#define TMRA_CMPAR1_CMP_15                   ((uint16_t)0x8000U)

/*  Bit definition for TMRA_CMPAR2 register  */
#define TMRA_CMPAR2_CMP_POS                  (0U)
#define TMRA_CMPAR2_CMP                      ((uint16_t)0xFFFFU)
#define TMRA_CMPAR2_CMP_0                    ((uint16_t)0x0001U)
#define TMRA_CMPAR2_CMP_1                    ((uint16_t)0x0002U)
#define TMRA_CMPAR2_CMP_2                    ((uint16_t)0x0004U)
#define TMRA_CMPAR2_CMP_3                    ((uint16_t)0x0008U)
#define TMRA_CMPAR2_CMP_4                    ((uint16_t)0x0010U)
#define TMRA_CMPAR2_CMP_5                    ((uint16_t)0x0020U)
#define TMRA_CMPAR2_CMP_6                    ((uint16_t)0x0040U)
#define TMRA_CMPAR2_CMP_7                    ((uint16_t)0x0080U)
#define TMRA_CMPAR2_CMP_8                    ((uint16_t)0x0100U)
#define TMRA_CMPAR2_CMP_9                    ((uint16_t)0x0200U)
#define TMRA_CMPAR2_CMP_10                   ((uint16_t)0x0400U)
#define TMRA_CMPAR2_CMP_11                   ((uint16_t)0x0800U)
#define TMRA_CMPAR2_CMP_12                   ((uint16_t)0x1000U)
#define TMRA_CMPAR2_CMP_13                   ((uint16_t)0x2000U)
#define TMRA_CMPAR2_CMP_14                   ((uint16_t)0x4000U)
#define TMRA_CMPAR2_CMP_15                   ((uint16_t)0x8000U)

