hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/mcu/common/hc32m120.h
typedef struct
{
    uint32_t DAT7_0;
    uint32_t DAT7_1;
    uint32_t DAT7_2;
    uint32_t DAT7_3;
    uint32_t DAT7_4;
    uint32_t DAT7_5;
    uint32_t DAT7_6;
    uint32_t DAT7_7;
    uint32_t DAT7_8;
    uint32_t DAT7_9;
    uint32_t DAT7_10;
    uint32_t DAT7_11;
    uint32_t DAT7_12;
    uint32_t DAT7_13;
    uint32_t DAT7_14;
    uint32_t DAT7_15;
    uint32_t DAT7_16;
    uint32_t DAT7_17;
    uint32_t DAT7_18;
    uint32_t DAT7_19;
    uint32_t DAT7_20;
    uint32_t DAT7_21;
    uint32_t DAT7_22;
    uint32_t DAT7_23;
    uint32_t DAT7_24;
    uint32_t DAT7_25;
    uint32_t DAT7_26;
    uint32_t DAT7_27;
    uint32_t DAT7_28;
    uint32_t DAT7_29;
    uint32_t DAT7_30;
    uint32_t DAT7_31;
} stc_crc_dat7_bit_t;

typedef struct
{
    uint32_t DAT8_0;
    uint32_t DAT8_1;
    uint32_t DAT8_2;
    uint32_t DAT8_3;
    uint32_t DAT8_4;
    uint32_t DAT8_5;
    uint32_t DAT8_6;
    uint32_t DAT8_7;
    uint32_t DAT8_8;
    uint32_t DAT8_9;
    uint32_t DAT8_10;
    uint32_t DAT8_11;
    uint32_t DAT8_12;
    uint32_t DAT8_13;
    uint32_t DAT8_14;
    uint32_t DAT8_15;
    uint32_t DAT8_16;
    uint32_t DAT8_17;
    uint32_t DAT8_18;
    uint32_t DAT8_19;
    uint32_t DAT8_20;
    uint32_t DAT8_21;
    uint32_t DAT8_22;
    uint32_t DAT8_23;
    uint32_t DAT8_24;
    uint32_t DAT8_25;
    uint32_t DAT8_26;
    uint32_t DAT8_27;
    uint32_t DAT8_28;
    uint32_t DAT8_29;
    uint32_t DAT8_30;
    uint32_t DAT8_31;
} stc_crc_dat8_bit_t;

typedef struct
{
    uint32_t DAT9_0;
    uint32_t DAT9_1;
    uint32_t DAT9_2;
    uint32_t DAT9_3;
    uint32_t DAT9_4;
    uint32_t DAT9_5;
    uint32_t DAT9_6;
    uint32_t DAT9_7;
    uint32_t DAT9_8;
    uint32_t DAT9_9;
    uint32_t DAT9_10;
    uint32_t DAT9_11;
    uint32_t DAT9_12;
    uint32_t DAT9_13;
    uint32_t DAT9_14;
    uint32_t DAT9_15;
    uint32_t DAT9_16;
    uint32_t DAT9_17;
    uint32_t DAT9_18;
    uint32_t DAT9_19;
    uint32_t DAT9_20;
    uint32_t DAT9_21;
    uint32_t DAT9_22;
    uint32_t DAT9_23;
    uint32_t DAT9_24;
    uint32_t DAT9_25;
    uint32_t DAT9_26;
    uint32_t DAT9_27;
    uint32_t DAT9_28;
    uint32_t DAT9_29;
    uint32_t DAT9_30;
    uint32_t DAT9_31;
} stc_crc_dat9_bit_t;

typedef struct
{
    uint32_t DAT10_0;
    uint32_t DAT10_1;
    uint32_t DAT10_2;
    uint32_t DAT10_3;
    uint32_t DAT10_4;
    uint32_t DAT10_5;
    uint32_t DAT10_6;
    uint32_t DAT10_7;
    uint32_t DAT10_8;
    uint32_t DAT10_9;
    uint32_t DAT10_10;
    uint32_t DAT10_11;
    uint32_t DAT10_12;
    uint32_t DAT10_13;
    uint32_t DAT10_14;
    uint32_t DAT10_15;
    uint32_t DAT10_16;
    uint32_t DAT10_17;
    uint32_t DAT10_18;
    uint32_t DAT10_19;
    uint32_t DAT10_20;
    uint32_t DAT10_21;
    uint32_t DAT10_22;
    uint32_t DAT10_23;
    uint32_t DAT10_24;
    uint32_t DAT10_25;
    uint32_t DAT10_26;
    uint32_t DAT10_27;
    uint32_t DAT10_28;
    uint32_t DAT10_29;
    uint32_t DAT10_30;
    uint32_t DAT10_31;
} stc_crc_dat10_bit_t;

typedef struct
{
    uint32_t DAT11_0;
    uint32_t DAT11_1;
    uint32_t DAT11_2;
    uint32_t DAT11_3;
    uint32_t DAT11_4;
    uint32_t DAT11_5;
    uint32_t DAT11_6;
    uint32_t DAT11_7;
    uint32_t DAT11_8;
    uint32_t DAT11_9;
    uint32_t DAT11_10;
    uint32_t DAT11_11;
    uint32_t DAT11_12;
    uint32_t DAT11_13;
    uint32_t DAT11_14;
    uint32_t DAT11_15;
    uint32_t DAT11_16;
    uint32_t DAT11_17;
    uint32_t DAT11_18;
    uint32_t DAT11_19;
    uint32_t DAT11_20;
    uint32_t DAT11_21;
    uint32_t DAT11_22;
    uint32_t DAT11_23;
    uint32_t DAT11_24;
    uint32_t DAT11_25;
    uint32_t DAT11_26;
    uint32_t DAT11_27;
    uint32_t DAT11_28;
    uint32_t DAT11_29;
    uint32_t DAT11_30;
    uint32_t DAT11_31;
} stc_crc_dat11_bit_t;

typedef struct
{
    uint32_t DAT12_0;
    uint32_t DAT12_1;
    uint32_t DAT12_2;
    uint32_t DAT12_3;
    uint32_t DAT12_4;
    uint32_t DAT12_5;
    uint32_t DAT12_6;
    uint32_t DAT12_7;
    uint32_t DAT12_8;
    uint32_t DAT12_9;
    uint32_t DAT12_10;
    uint32_t DAT12_11;
    uint32_t DAT12_12;
    uint32_t DAT12_13;
    uint32_t DAT12_14;
    uint32_t DAT12_15;
    uint32_t DAT12_16;
    uint32_t DAT12_17;
    uint32_t DAT12_18;
    uint32_t DAT12_19;
    uint32_t DAT12_20;
    uint32_t DAT12_21;
    uint32_t DAT12_22;
    uint32_t DAT12_23;
    uint32_t DAT12_24;
    uint32_t DAT12_25;
    uint32_t DAT12_26;
    uint32_t DAT12_27;
    uint32_t DAT12_28;
    uint32_t DAT12_29;
    uint32_t DAT12_30;
    uint32_t DAT12_31;
} stc_crc_dat12_bit_t;

typedef struct
{
    uint32_t DAT13_0;
    uint32_t DAT13_1;
    uint32_t DAT13_2;
    uint32_t DAT13_3;
    uint32_t DAT13_4;
    uint32_t DAT13_5;
    uint32_t DAT13_6;
    uint32_t DAT13_7;
    uint32_t DAT13_8;
    uint32_t DAT13_9;
    uint32_t DAT13_10;
    uint32_t DAT13_11;
    uint32_t DAT13_12;
    uint32_t DAT13_13;
    uint32_t DAT13_14;
    uint32_t DAT13_15;
    uint32_t DAT13_16;
    uint32_t DAT13_17;
    uint32_t DAT13_18;
    uint32_t DAT13_19;
    uint32_t DAT13_20;
    uint32_t DAT13_21;
    uint32_t DAT13_22;
    uint32_t DAT13_23;
    uint32_t DAT13_24;
    uint32_t DAT13_25;
    uint32_t DAT13_26;
    uint32_t DAT13_27;
    uint32_t DAT13_28;
    uint32_t DAT13_29;
    uint32_t DAT13_30;
    uint32_t DAT13_31;
} stc_crc_dat13_bit_t;

typedef struct
{
    uint32_t DAT14_0;
    uint32_t DAT14_1;
    uint32_t DAT14_2;
    uint32_t DAT14_3;
    uint32_t DAT14_4;
    uint32_t DAT14_5;
    uint32_t DAT14_6;
    uint32_t DAT14_7;
    uint32_t DAT14_8;
    uint32_t DAT14_9;
    uint32_t DAT14_10;
    uint32_t DAT14_11;
    uint32_t DAT14_12;
    uint32_t DAT14_13;
    uint32_t DAT14_14;
    uint32_t DAT14_15;
    uint32_t DAT14_16;
    uint32_t DAT14_17;
    uint32_t DAT14_18;
    uint32_t DAT14_19;
    uint32_t DAT14_20;
    uint32_t DAT14_21;
    uint32_t DAT14_22;
    uint32_t DAT14_23;
    uint32_t DAT14_24;
    uint32_t DAT14_25;
    uint32_t DAT14_26;
    uint32_t DAT14_27;
    uint32_t DAT14_28;
    uint32_t DAT14_29;
    uint32_t DAT14_30;
    uint32_t DAT14_31;
} stc_crc_dat14_bit_t;

typedef struct
{
    uint32_t DAT15_0;
    uint32_t DAT15_1;
    uint32_t DAT15_2;
    uint32_t DAT15_3;
    uint32_t DAT15_4;
    uint32_t DAT15_5;
    uint32_t DAT15_6;
    uint32_t DAT15_7;
    uint32_t DAT15_8;
    uint32_t DAT15_9;
    uint32_t DAT15_10;
    uint32_t DAT15_11;
    uint32_t DAT15_12;
    uint32_t DAT15_13;
    uint32_t DAT15_14;
    uint32_t DAT15_15;
    uint32_t DAT15_16;
    uint32_t DAT15_17;
    uint32_t DAT15_18;
    uint32_t DAT15_19;
    uint32_t DAT15_20;
    uint32_t DAT15_21;
    uint32_t DAT15_22;
    uint32_t DAT15_23;
    uint32_t DAT15_24;
    uint32_t DAT15_25;
    uint32_t DAT15_26;
    uint32_t DAT15_27;
    uint32_t DAT15_28;
    uint32_t DAT15_29;
    uint32_t DAT15_30;
    uint32_t DAT15_31;
} stc_crc_dat15_bit_t;

typedef struct
{
    uint32_t DAT16_0;
    uint32_t DAT16_1;
    uint32_t DAT16_2;
    uint32_t DAT16_3;
    uint32_t DAT16_4;
    uint32_t DAT16_5;
    uint32_t DAT16_6;
    uint32_t DAT16_7;
    uint32_t DAT16_8;
    uint32_t DAT16_9;
    uint32_t DAT16_10;
    uint32_t DAT16_11;
    uint32_t DAT16_12;
    uint32_t DAT16_13;
    uint32_t DAT16_14;
    uint32_t DAT16_15;
    uint32_t DAT16_16;
    uint32_t DAT16_17;
    uint32_t DAT16_18;
    uint32_t DAT16_19;
    uint32_t DAT16_20;
    uint32_t DAT16_21;
    uint32_t DAT16_22;
    uint32_t DAT16_23;
    uint32_t DAT16_24;
    uint32_t DAT16_25;
    uint32_t DAT16_26;
    uint32_t DAT16_27;
    uint32_t DAT16_28;
    uint32_t DAT16_29;
    uint32_t DAT16_30;
    uint32_t DAT16_31;
} stc_crc_dat16_bit_t;

typedef struct
{
    uint32_t DAT17_0;
    uint32_t DAT17_1;
    uint32_t DAT17_2;
    uint32_t DAT17_3;
    uint32_t DAT17_4;
    uint32_t DAT17_5;
    uint32_t DAT17_6;
    uint32_t DAT17_7;
    uint32_t DAT17_8;
    uint32_t DAT17_9;
    uint32_t DAT17_10;
    uint32_t DAT17_11;
    uint32_t DAT17_12;
    uint32_t DAT17_13;
    uint32_t DAT17_14;
    uint32_t DAT17_15;
    uint32_t DAT17_16;
    uint32_t DAT17_17;
    uint32_t DAT17_18;
    uint32_t DAT17_19;
    uint32_t DAT17_20;
    uint32_t DAT17_21;
    uint32_t DAT17_22;
    uint32_t DAT17_23;
    uint32_t DAT17_24;
    uint32_t DAT17_25;
    uint32_t DAT17_26;
    uint32_t DAT17_27;
    uint32_t DAT17_28;
    uint32_t DAT17_29;
    uint32_t DAT17_30;
    uint32_t DAT17_31;
} stc_crc_dat17_bit_t;

typedef struct
{
    uint32_t DAT18_0;
    uint32_t DAT18_1;
    uint32_t DAT18_2;
    uint32_t DAT18_3;
    uint32_t DAT18_4;
    uint32_t DAT18_5;
    uint32_t DAT18_6;
    uint32_t DAT18_7;
    uint32_t DAT18_8;
    uint32_t DAT18_9;
    uint32_t DAT18_10;
    uint32_t DAT18_11;
    uint32_t DAT18_12;
    uint32_t DAT18_13;
    uint32_t DAT18_14;
    uint32_t DAT18_15;
    uint32_t DAT18_16;
    uint32_t DAT18_17;
    uint32_t DAT18_18;
    uint32_t DAT18_19;
    uint32_t DAT18_20;
    uint32_t DAT18_21;
    uint32_t DAT18_22;
    uint32_t DAT18_23;
    uint32_t DAT18_24;
    uint32_t DAT18_25;
    uint32_t DAT18_26;
    uint32_t DAT18_27;
    uint32_t DAT18_28;
    uint32_t DAT18_29;
    uint32_t DAT18_30;
    uint32_t DAT18_31;
} stc_crc_dat18_bit_t;

typedef struct
{
    uint32_t DAT19_0;
    uint32_t DAT19_1;
    uint32_t DAT19_2;
    uint32_t DAT19_3;
    uint32_t DAT19_4;
    uint32_t DAT19_5;
    uint32_t DAT19_6;
    uint32_t DAT19_7;
    uint32_t DAT19_8;
    uint32_t DAT19_9;
    uint32_t DAT19_10;
    uint32_t DAT19_11;
    uint32_t DAT19_12;
    uint32_t DAT19_13;
    uint32_t DAT19_14;
    uint32_t DAT19_15;
    uint32_t DAT19_16;
    uint32_t DAT19_17;
    uint32_t DAT19_18;
    uint32_t DAT19_19;
    uint32_t DAT19_20;
    uint32_t DAT19_21;
    uint32_t DAT19_22;
    uint32_t DAT19_23;
    uint32_t DAT19_24;
    uint32_t DAT19_25;
    uint32_t DAT19_26;
    uint32_t DAT19_27;
    uint32_t DAT19_28;
    uint32_t DAT19_29;
    uint32_t DAT19_30;
    uint32_t DAT19_31;
} stc_crc_dat19_bit_t;

typedef struct
{
    uint32_t DAT20_0;
    uint32_t DAT20_1;
    uint32_t DAT20_2;
    uint32_t DAT20_3;
    uint32_t DAT20_4;
    uint32_t DAT20_5;
    uint32_t DAT20_6;
    uint32_t DAT20_7;
    uint32_t DAT20_8;
    uint32_t DAT20_9;
    uint32_t DAT20_10;
    uint32_t DAT20_11;
    uint32_t DAT20_12;
    uint32_t DAT20_13;
    uint32_t DAT20_14;
    uint32_t DAT20_15;
    uint32_t DAT20_16;
    uint32_t DAT20_17;
    uint32_t DAT20_18;
    uint32_t DAT20_19;
    uint32_t DAT20_20;
    uint32_t DAT20_21;
    uint32_t DAT20_22;
    uint32_t DAT20_23;
    uint32_t DAT20_24;
    uint32_t DAT20_25;
    uint32_t DAT20_26;
    uint32_t DAT20_27;
    uint32_t DAT20_28;
    uint32_t DAT20_29;
    uint32_t DAT20_30;
    uint32_t DAT20_31;
} stc_crc_dat20_bit_t;

typedef struct
{
    uint32_t DAT21_0;
    uint32_t DAT21_1;
    uint32_t DAT21_2;
    uint32_t DAT21_3;
    uint32_t DAT21_4;
    uint32_t DAT21_5;
    uint32_t DAT21_6;
    uint32_t DAT21_7;
    uint32_t DAT21_8;
    uint32_t DAT21_9;
    uint32_t DAT21_10;
    uint32_t DAT21_11;
    uint32_t DAT21_12;
    uint32_t DAT21_13;
    uint32_t DAT21_14;
    uint32_t DAT21_15;
    uint32_t DAT21_16;
    uint32_t DAT21_17;
    uint32_t DAT21_18;
    uint32_t DAT21_19;
    uint32_t DAT21_20;
    uint32_t DAT21_21;
    uint32_t DAT21_22;
    uint32_t DAT21_23;
    uint32_t DAT21_24;
    uint32_t DAT21_25;
    uint32_t DAT21_26;
    uint32_t DAT21_27;
    uint32_t DAT21_28;
    uint32_t DAT21_29;
    uint32_t DAT21_30;
    uint32_t DAT21_31;
} stc_crc_dat21_bit_t;

typedef struct
{
    uint32_t DAT22_0;
    uint32_t DAT22_1;
    uint32_t DAT22_2;
    uint32_t DAT22_3;
    uint32_t DAT22_4;
    uint32_t DAT22_5;
    uint32_t DAT22_6;
    uint32_t DAT22_7;
    uint32_t DAT22_8;
    uint32_t DAT22_9;
    uint32_t DAT22_10;
    uint32_t DAT22_11;
    uint32_t DAT22_12;
    uint32_t DAT22_13;
    uint32_t DAT22_14;
    uint32_t DAT22_15;
    uint32_t DAT22_16;
    uint32_t DAT22_17;
    uint32_t DAT22_18;
    uint32_t DAT22_19;
    uint32_t DAT22_20;
    uint32_t DAT22_21;
    uint32_t DAT22_22;
    uint32_t DAT22_23;
    uint32_t DAT22_24;
    uint32_t DAT22_25;
    uint32_t DAT22_26;
    uint32_t DAT22_27;
    uint32_t DAT22_28;
    uint32_t DAT22_29;
    uint32_t DAT22_30;
    uint32_t DAT22_31;
} stc_crc_dat22_bit_t;

typedef struct
{
    uint32_t DAT23_0;
    uint32_t DAT23_1;
    uint32_t DAT23_2;
    uint32_t DAT23_3;
    uint32_t DAT23_4;
    uint32_t DAT23_5;
    uint32_t DAT23_6;
    uint32_t DAT23_7;
    uint32_t DAT23_8;
    uint32_t DAT23_9;
    uint32_t DAT23_10;
    uint32_t DAT23_11;
    uint32_t DAT23_12;
    uint32_t DAT23_13;
    uint32_t DAT23_14;
    uint32_t DAT23_15;
    uint32_t DAT23_16;
    uint32_t DAT23_17;
    uint32_t DAT23_18;
    uint32_t DAT23_19;
    uint32_t DAT23_20;
    uint32_t DAT23_21;
    uint32_t DAT23_22;
    uint32_t DAT23_23;
    uint32_t DAT23_24;
    uint32_t DAT23_25;
    uint32_t DAT23_26;
    uint32_t DAT23_27;
    uint32_t DAT23_28;
    uint32_t DAT23_29;
    uint32_t DAT23_30;
    uint32_t DAT23_31;
} stc_crc_dat23_bit_t;

typedef struct
{
    uint32_t DAT24_0;
    uint32_t DAT24_1;
    uint32_t DAT24_2;
    uint32_t DAT24_3;
    uint32_t DAT24_4;
    uint32_t DAT24_5;
    uint32_t DAT24_6;
    uint32_t DAT24_7;
    uint32_t DAT24_8;
    uint32_t DAT24_9;
    uint32_t DAT24_10;
    uint32_t DAT24_11;
    uint32_t DAT24_12;
    uint32_t DAT24_13;
    uint32_t DAT24_14;
    uint32_t DAT24_15;
    uint32_t DAT24_16;
    uint32_t DAT24_17;
    uint32_t DAT24_18;
    uint32_t DAT24_19;
    uint32_t DAT24_20;
    uint32_t DAT24_21;
    uint32_t DAT24_22;
    uint32_t DAT24_23;
    uint32_t DAT24_24;
    uint32_t DAT24_25;
    uint32_t DAT24_26;
    uint32_t DAT24_27;
    uint32_t DAT24_28;
    uint32_t DAT24_29;
    uint32_t DAT24_30;
    uint32_t DAT24_31;
} stc_crc_dat24_bit_t;

typedef struct
{
    uint32_t DAT25_0;
    uint32_t DAT25_1;
    uint32_t DAT25_2;
    uint32_t DAT25_3;
    uint32_t DAT25_4;
    uint32_t DAT25_5;
    uint32_t DAT25_6;
    uint32_t DAT25_7;
    uint32_t DAT25_8;
    uint32_t DAT25_9;
    uint32_t DAT25_10;
    uint32_t DAT25_11;
    uint32_t DAT25_12;
    uint32_t DAT25_13;
    uint32_t DAT25_14;
    uint32_t DAT25_15;
    uint32_t DAT25_16;
    uint32_t DAT25_17;
    uint32_t DAT25_18;
    uint32_t DAT25_19;
    uint32_t DAT25_20;
    uint32_t DAT25_21;
    uint32_t DAT25_22;
    uint32_t DAT25_23;
    uint32_t DAT25_24;
    uint32_t DAT25_25;
    uint32_t DAT25_26;
    uint32_t DAT25_27;
    uint32_t DAT25_28;
    uint32_t DAT25_29;
    uint32_t DAT25_30;
    uint32_t DAT25_31;
} stc_crc_dat25_bit_t;

typedef struct
{
    uint32_t DAT26_0;
    uint32_t DAT26_1;
    uint32_t DAT26_2;
    uint32_t DAT26_3;
    uint32_t DAT26_4;
    uint32_t DAT26_5;
    uint32_t DAT26_6;
    uint32_t DAT26_7;
    uint32_t DAT26_8;
    uint32_t DAT26_9;
    uint32_t DAT26_10;
    uint32_t DAT26_11;
    uint32_t DAT26_12;
    uint32_t DAT26_13;
    uint32_t DAT26_14;
    uint32_t DAT26_15;
    uint32_t DAT26_16;
    uint32_t DAT26_17;
    uint32_t DAT26_18;
    uint32_t DAT26_19;
    uint32_t DAT26_20;
    uint32_t DAT26_21;
    uint32_t DAT26_22;
    uint32_t DAT26_23;
    uint32_t DAT26_24;
    uint32_t DAT26_25;
    uint32_t DAT26_26;
    uint32_t DAT26_27;
    uint32_t DAT26_28;
    uint32_t DAT26_29;
    uint32_t DAT26_30;
    uint32_t DAT26_31;
} stc_crc_dat26_bit_t;

typedef struct
{
    uint32_t DAT27_0;
    uint32_t DAT27_1;
    uint32_t DAT27_2;
    uint32_t DAT27_3;
    uint32_t DAT27_4;
    uint32_t DAT27_5;
    uint32_t DAT27_6;
    uint32_t DAT27_7;
    uint32_t DAT27_8;
    uint32_t DAT27_9;
    uint32_t DAT27_10;
    uint32_t DAT27_11;
    uint32_t DAT27_12;
    uint32_t DAT27_13;
    uint32_t DAT27_14;
    uint32_t DAT27_15;
    uint32_t DAT27_16;
    uint32_t DAT27_17;
    uint32_t DAT27_18;
    uint32_t DAT27_19;
    uint32_t DAT27_20;
    uint32_t DAT27_21;
    uint32_t DAT27_22;
    uint32_t DAT27_23;
    uint32_t DAT27_24;
    uint32_t DAT27_25;
    uint32_t DAT27_26;
    uint32_t DAT27_27;
    uint32_t DAT27_28;
    uint32_t DAT27_29;
    uint32_t DAT27_30;
    uint32_t DAT27_31;
} stc_crc_dat27_bit_t;

typedef struct
{
    uint32_t DAT28_0;
    uint32_t DAT28_1;
    uint32_t DAT28_2;
    uint32_t DAT28_3;
    uint32_t DAT28_4;
    uint32_t DAT28_5;
    uint32_t DAT28_6;
    uint32_t DAT28_7;
    uint32_t DAT28_8;
    uint32_t DAT28_9;
    uint32_t DAT28_10;
    uint32_t DAT28_11;
    uint32_t DAT28_12;
    uint32_t DAT28_13;
    uint32_t DAT28_14;
    uint32_t DAT28_15;
    uint32_t DAT28_16;
    uint32_t DAT28_17;
    uint32_t DAT28_18;
    uint32_t DAT28_19;
    uint32_t DAT28_20;
    uint32_t DAT28_21;
    uint32_t DAT28_22;
    uint32_t DAT28_23;
    uint32_t DAT28_24;
    uint32_t DAT28_25;
    uint32_t DAT28_26;
    uint32_t DAT28_27;
    uint32_t DAT28_28;
    uint32_t DAT28_29;
    uint32_t DAT28_30;
    uint32_t DAT28_31;
} stc_crc_dat28_bit_t;

typedef struct
{
    uint32_t DAT29_0;
    uint32_t DAT29_1;
    uint32_t DAT29_2;
    uint32_t DAT29_3;
    uint32_t DAT29_4;
    uint32_t DAT29_5;
    uint32_t DAT29_6;
    uint32_t DAT29_7;
    uint32_t DAT29_8;
    uint32_t DAT29_9;
    uint32_t DAT29_10;
    uint32_t DAT29_11;
    uint32_t DAT29_12;
    uint32_t DAT29_13;
    uint32_t DAT29_14;
    uint32_t DAT29_15;
    uint32_t DAT29_16;
    uint32_t DAT29_17;
    uint32_t DAT29_18;
    uint32_t DAT29_19;
    uint32_t DAT29_20;
    uint32_t DAT29_21;
    uint32_t DAT29_22;
    uint32_t DAT29_23;
    uint32_t DAT29_24;
    uint32_t DAT29_25;
    uint32_t DAT29_26;
    uint32_t DAT29_27;
    uint32_t DAT29_28;
    uint32_t DAT29_29;
    uint32_t DAT29_30;
    uint32_t DAT29_31;
} stc_crc_dat29_bit_t;

typedef struct
{
    uint32_t DAT30_0;
    uint32_t DAT30_1;
    uint32_t DAT30_2;
    uint32_t DAT30_3;
    uint32_t DAT30_4;
    uint32_t DAT30_5;
    uint32_t DAT30_6;
    uint32_t DAT30_7;
    uint32_t DAT30_8;
    uint32_t DAT30_9;
    uint32_t DAT30_10;
    uint32_t DAT30_11;
    uint32_t DAT30_12;
    uint32_t DAT30_13;
    uint32_t DAT30_14;
    uint32_t DAT30_15;
    uint32_t DAT30_16;
    uint32_t DAT30_17;
    uint32_t DAT30_18;
    uint32_t DAT30_19;
    uint32_t DAT30_20;
    uint32_t DAT30_21;
    uint32_t DAT30_22;
    uint32_t DAT30_23;
    uint32_t DAT30_24;
    uint32_t DAT30_25;
    uint32_t DAT30_26;
    uint32_t DAT30_27;
    uint32_t DAT30_28;
    uint32_t DAT30_29;
    uint32_t DAT30_30;
    uint32_t DAT30_31;
} stc_crc_dat30_bit_t;

typedef struct
{
    uint32_t DAT31_0;
    uint32_t DAT31_1;
    uint32_t DAT31_2;
    uint32_t DAT31_3;
    uint32_t DAT31_4;
    uint32_t DAT31_5;
    uint32_t DAT31_6;
    uint32_t DAT31_7;
    uint32_t DAT31_8;
    uint32_t DAT31_9;
    uint32_t DAT31_10;
    uint32_t DAT31_11;
    uint32_t DAT31_12;
    uint32_t DAT31_13;
    uint32_t DAT31_14;
    uint32_t DAT31_15;
    uint32_t DAT31_16;
    uint32_t DAT31_17;
    uint32_t DAT31_18;
    uint32_t DAT31_19;
    uint32_t DAT31_20;
    uint32_t DAT31_21;
    uint32_t DAT31_22;
    uint32_t DAT31_23;
    uint32_t DAT31_24;
    uint32_t DAT31_25;
    uint32_t DAT31_26;
    uint32_t DAT31_27;
    uint32_t DAT31_28;
    uint32_t DAT31_29;
    uint32_t DAT31_30;
    uint32_t DAT31_31;
} stc_crc_dat31_bit_t;

typedef struct
{
    __IO uint32_t REFPSC0;
    __IO uint32_t REFPSC1;
    __IO uint32_t REFPSC2;
    uint32_t RESERVED0[1];
    __IO uint32_t REFCKS0;
    __IO uint32_t REFCKS1;
    __IO uint32_t ERRIE;
    __IO uint32_t CTCEN;
    uint32_t RESERVED1[8];
    __IO uint32_t TRMVAL0;
    __IO uint32_t TRMVAL1;
    __IO uint32_t TRMVAL2;
    __IO uint32_t TRMVAL3;
    __IO uint32_t TRMVAL4;
    __IO uint32_t TRMVAL5;
    uint32_t RESERVED2[10];
} stc_ctc_cr1_bit_t;

typedef struct
{
    __IO uint32_t OFSVAL0;
    __IO uint32_t OFSVAL1;
    __IO uint32_t OFSVAL2;
    __IO uint32_t OFSVAL3;
    __IO uint32_t OFSVAL4;
    __IO uint32_t OFSVAL5;
    __IO uint32_t OFSVAL6;
    __IO uint32_t OFSVAL7;
    uint32_t RESERVED0[8];
    __IO uint32_t RLDVAL0;
    __IO uint32_t RLDVAL1;
    __IO uint32_t RLDVAL2;
    __IO uint32_t RLDVAL3;
    __IO uint32_t RLDVAL4;
    __IO uint32_t RLDVAL5;
    __IO uint32_t RLDVAL6;
    __IO uint32_t RLDVAL7;
    __IO uint32_t RLDVAL8;
    __IO uint32_t RLDVAL9;
    __IO uint32_t RLDVAL10;
    __IO uint32_t RLDVAL11;
    __IO uint32_t RLDVAL12;
    __IO uint32_t RLDVAL13;
    __IO uint32_t RLDVAL14;
    __IO uint32_t RLDVAL15;
} stc_ctc_cr2_bit_t;

typedef struct
{
    __IO uint32_t TRIMOK;
    __IO uint32_t TRMOVF;
    __IO uint32_t TRMUDF;
    __IO uint32_t CTCBSY;
    uint32_t RESERVED0[28];
} stc_ctc_str_bit_t;

typedef struct
{
    __IO uint32_t CDBGPWRUPREQ;
    __IO uint32_t CDBGPWRUPACK;
    uint32_t RESERVED0[30];
} stc_dbgc_mcudbgstat_bit_t;

typedef struct
{
    __IO uint32_t SWDTSTP;
    uint32_t RESERVED0[1];
    __IO uint32_t RTCSTP;
    __IO uint32_t PVDSTP;
    uint32_t RESERVED1[10];
    __IO uint32_t TMR01STP;
    uint32_t RESERVED2[2];
    __IO uint32_t TMR21STP;
    uint32_t RESERVED3[2];
    __IO uint32_t TMR41STP;
    uint32_t RESERVED4[2];
    __IO uint32_t TMRA1STP;
    __IO uint32_t TMRB1STP;
    __IO uint32_t TMRB2STP;
    __IO uint32_t TMRB3STP;
    __IO uint32_t TMRB4STP;
    __IO uint32_t TMRB5STP;
    __IO uint32_t TMRB6STP;
    __IO uint32_t TMRB7STP;
    __IO uint32_t TMRB8STP;
} stc_dbgc_mcustpctl_bit_t;

typedef struct
{
    uint32_t AUTHID0_0;
    uint32_t AUTHID0_1;
    uint32_t AUTHID0_2;
    uint32_t AUTHID0_3;
    uint32_t AUTHID0_4;
    uint32_t AUTHID0_5;
    uint32_t AUTHID0_6;
    uint32_t AUTHID0_7;
    uint32_t AUTHID0_8;
    uint32_t AUTHID0_9;
    uint32_t AUTHID0_10;
    uint32_t AUTHID0_11;
    uint32_t AUTHID0_12;
    uint32_t AUTHID0_13;
    uint32_t AUTHID0_14;
    uint32_t AUTHID0_15;
    uint32_t AUTHID0_16;
    uint32_t AUTHID0_17;
    uint32_t AUTHID0_18;
    uint32_t AUTHID0_19;
    uint32_t AUTHID0_20;
    uint32_t AUTHID0_21;
    uint32_t AUTHID0_22;
    uint32_t AUTHID0_23;
    uint32_t AUTHID0_24;
    uint32_t AUTHID0_25;
    uint32_t AUTHID0_26;
    uint32_t AUTHID0_27;
    uint32_t AUTHID0_28;
    uint32_t AUTHID0_29;
    uint32_t AUTHID0_30;
    uint32_t AUTHID0_31;
} stc_dbgc_t_authid0_bit_t;

typedef struct
{
    uint32_t AUTHID1_0;
    uint32_t AUTHID1_1;
    uint32_t AUTHID1_2;
    uint32_t AUTHID1_3;
    uint32_t AUTHID1_4;
    uint32_t AUTHID1_5;
    uint32_t AUTHID1_6;
    uint32_t AUTHID1_7;
    uint32_t AUTHID1_8;
    uint32_t AUTHID1_9;
    uint32_t AUTHID1_10;
    uint32_t AUTHID1_11;
    uint32_t AUTHID1_12;
    uint32_t AUTHID1_13;
    uint32_t AUTHID1_14;
    uint32_t AUTHID1_15;
    uint32_t AUTHID1_16;
    uint32_t AUTHID1_17;
    uint32_t AUTHID1_18;
    uint32_t AUTHID1_19;
    uint32_t AUTHID1_20;
    uint32_t AUTHID1_21;
    uint32_t AUTHID1_22;
    uint32_t AUTHID1_23;
    uint32_t AUTHID1_24;
    uint32_t AUTHID1_25;
    uint32_t AUTHID1_26;
    uint32_t AUTHID1_27;
    uint32_t AUTHID1_28;
    uint32_t AUTHID1_29;
    uint32_t AUTHID1_30;
    uint32_t AUTHID1_31;
} stc_dbgc_t_authid1_bit_t;

typedef struct
{
    uint32_t AUTHID2_0;
    uint32_t AUTHID2_1;
    uint32_t AUTHID2_2;
    uint32_t AUTHID2_3;
    uint32_t AUTHID2_4;
    uint32_t AUTHID2_5;
    uint32_t AUTHID2_6;
    uint32_t AUTHID2_7;
    uint32_t AUTHID2_8;
    uint32_t AUTHID2_9;
    uint32_t AUTHID2_10;
    uint32_t AUTHID2_11;
    uint32_t AUTHID2_12;
    uint32_t AUTHID2_13;
    uint32_t AUTHID2_14;
    uint32_t AUTHID2_15;
    uint32_t AUTHID2_16;
    uint32_t AUTHID2_17;
    uint32_t AUTHID2_18;
    uint32_t AUTHID2_19;
    uint32_t AUTHID2_20;
    uint32_t AUTHID2_21;
    uint32_t AUTHID2_22;
    uint32_t AUTHID2_23;
    uint32_t AUTHID2_24;
    uint32_t AUTHID2_25;
    uint32_t AUTHID2_26;
    uint32_t AUTHID2_27;
    uint32_t AUTHID2_28;
    uint32_t AUTHID2_29;
    uint32_t AUTHID2_30;
    uint32_t AUTHID2_31;
} stc_dbgc_t_authid2_bit_t;

